[ 
    {
        "Continent": "Europe",
        "Country": "Austria",
        "University": "University of Vienna",
        "Description": "The University of Vienna was established by its founder Duke Rudolf IV on 12th March 1365, on the model of theUniversities of Bologna and Paris. It is the oldest university in the present-day German linguistic and culturalterritory. \nThe eight faculties of the University of Vienna offer a total of 130 courses of study currently attended by about 90,000 students from 130 countries. It is the largest university of Austria with a teaching staff of more than 4,000 and approximately 3,000 students graduating each year.",
        "Users":[["Ong Ai Wei","F","Year 2", "SCIS"], ["Gerald Ng","M","Year 2", "SCIS"]]
    },
    {
        "Continent": "Europe",
        "Country": "Austria",
        "University": "Vienna University of Economics and Business",
        "Description": "The WU is over 100 years old. Its predecessor, the Imperial Export Academy, was established on October 1,1898, with the aim of imparting knowledge to businessmen engaged in foreign trade. Immediately following World War I, the Academy became a public World Trade University (Hochschule fur Welthandel), offering a three-year degree program. Following new legislation in 1966, the range of degrees was expanded to the four currently offered. The University was renamed in 1975, this time to Wirtschaftsuniversität Wien (Vienna University of Economics and Business Administration). In 1983, foreign language teaching was expanded at the WU and basic IT studies were made a compulsory part of its degree programs. The 1980s were a period of enormous growth at the WU – between 1981 and 1987 enrollment doubled, from 8,000 to 16,000 and since 1982 the WU has been housed in its large complex in Augasse, where its modern facilities are among the finest in Austria",
        "Users":[["Teh Xue Er","F","Year 3", "SCIS"], ["Belle Huang","F","Year 3", "SCIS"],["Jiang Jia Jian","F","Year 3","SCIS"]]
    },
    {
        "Continent": "Europe",
        "Country": "Austria",
        "University": "Vienna University of Economics and Business (School of Law‚Äì Themis)",
        "Description": "The WU is over 100 years old. Its predecessor, the Imperial Export Academy, was established on October 1,1898, with the aim of imparting knowledge to businessmen engaged in foreign trade. Immediately following World War I, the Academy became a public World Trade University (Hochschule fur Welthandel), offering a three-year degree program. Following new legislation in 1966, the range of degrees was expanded to the four currently offered. The University was renamed in 1975, this time to Wirtschaftsuniversität Wien (Vienna University of Economics and Business Administration).",
        "Users":[["Lim Yu Xuan","F","Year 3", "SCIS"], ["Callie Sim","F","Year 3", "SOB"],["Bay Kang Min","M","Year 3", "SOB"]]
    },
    {
        "Continent": "Europe",
        "Country": "Belgium",
        "University": "Solvay Brussels School - Economics and Management",
        "Description": "Solvay Brussels School – Economics & Management (SBS – EM) is located in the incredibly cosmopolitan Brussels,triple capital of Europe, Belgium and the Flanders region and also host to both NATO and the EU headquarters. Solvay Brussels School is part of Universite Libre du Bruxelles (ULB), which was established in 1834. Known for their strength in Quantitative Finance, they are part of the Q-TEM, a network of like-minded universities strong in this field.",
        "Users":[["Tan Yun Xian","F","Year 3", "SOB"], ["Ng Jing Wen","F","Year 3", "SOA"],["Pan Jia Qi","F","Year 3","SOE"]]
    },
    {
        "Continent": "Europe",
        "Country": "Belgium",
        "University": "Ghent University",
        "Description": "Ghent University is one of the major universities in the Dutch-speaking region of Europe and has been ranked top 100 universities in the world by both Shanghai AWRU and Times Higher Education ranking. It distinguishes itself as a socially committed and pluralistic, public university, with a broad international perspective. Its Faculty of Economics and Business Administration offers high-quality and socially relevant education, research and scientific services to the community.\nWhile its Faculty of Political and Social Sciences is a relatively young faculty that brings together education, research and service within the research areas of Political Sciences, Communication Sciences and Sociology, its Faculty of Law is one of the four founding faculties of the Ghent University and is highly ranked in QS World Subject Ranking.\nThe university is located in Ghent, a city located in the Flemish region of Belgium and also the capital and largest city of the East Flanders province.",
        "Users":[["Quek Ngee Xin","F","Year 4","SOE"], ["Wisaam bin Kanaan","M","Year 4","SOA"]]
    },
    {
        "Continent": "Europe",
        "Country": "Belgium",
        "University": "Katholieke Universiteit Leuven",
        "Description": "KU Leuven is one of the oldest and most influential Catholic universities in the world. Since its foundation in 1425 it has been a center of academic excellence. KU Leuven is Belgium’s largest university with a student population of about 27,000.The University is located in Leuven, a small but pleasant town 25 kilometers from Brussels, the capital of Belgium and of the European Union.",
        "Users":[["Lin Hao Ming","M","Year 4","SOE"], ["Umar Salim","M","Year 4","SOSS"]]
    },
    {
        "Continent": "Europe",
        "Country": "Belgium",
        "University": "Université Catholique de Louvain",
        "Description": "Founded in 1425, the Catholic University of Louvain is one of the oldest universities in Europe. It was split in 1971 into two separate universities, one Dutch-speaking remaining in Leuven (K.U. Leuven), one French-speaking, established in Louvain-la-Neuve and Brussels. Among its former researchers and teachers, there are Erasmus, Mercator, Vesalius, Vives and Lemaitre.\nToday, centers such as the Center for Operation Research and Econometrics (CORE), the Ludwig Institute and the ICP contribute to its international scope. UCL has 130,000 graduates throughout the world.",
        "Users":[["Koh Zhi En","F","Year 4","SOB"], ["Wisaam bin Kanaan","Year 4","SOSS"],["Lam Jun Cheng","M","Year 3","SCIS"]]
    },
    {
        "Continent": "Europe",
        "Country": "Croatia",
        "University": "Zagreb School of Economics and Management",
        "Description": "Founded in 2002, Zagreb School of Economics and Management (ZSEM) provides undergraduate and graduate education in economics, management, finance, marketing, and accounting. ZSEM received its AACSB accreditation in 2013 and is in the process of applying for the EQUIS. It has been voted as the best business school in Croatia for five consecutive years. As a young university with a global outlook, ZSEM prepares its students for the global labour market by offering, among its other Bachelor programmes, a fully English-taught track for its Bachelor in Economics & Management.\nZagreb is its nation’s capital, and the most populous city in Croatia. Zagreb today represents the administrative, economic, cultural, transportation and scientific center of Croatia.",
        "Users":[["Tang Lin Hui","F","Year 4", "SOE"], ["Lavanya Roy","F","Year 4", "SOSS"],["Xu Si Ling","F","Year 4","SOB"]]
    },
    {
        "Continent": "Europe",
        "Country": "Czech Republic",
        "University": "Prague University of Economics and Business",
        "Description": "VSE is one of the most renowned European universities in the field of economic education. The Commercial College – Vysoka skola obchodni (VSO) was founded in 1919 as an independent department of the Czech Technical University with specializations: wholesale trade, Banking and the Organization of Industrial Firms.\nIn 1929, VSO was reorganized. The study course is prolonged to four years, a definite incorporation of VSO into the Czech Technical University. In 1934, VSO gained the right to award the degree of Doctor of Commercial Sciences. The Nazis closed down VSO from 1939 to 1945. In 1949, VSO was the University of Political and Economic Sciences with three faculties Economics, Political and Diplomatic and Social Sciences. In 1953, VSE established five faculties: General Economics, Finance and Credit, Statistics, Production Economics and Commerce. From 1990 – 1991 following the Velvet Revolution VSE experienced a general reorganization. In 1998, VSE in Prague became a full member of CEMS. In 1999, it became a full member of PIM. It changed it’s English name from University of Economics, Prague to Prague University of Economics and Business from 1 October 2020.",
        "Users":[["Chia Rui Min","M","Year 4", "SOE"], ["Pooja Mitter","F","Year 4", "SOSS"]]
    },
    {
        "Continent": "Europe",
        "Country": "Denmark",
        "University": "Aarhus School of Business, University of Aarhus",
        "Description": "With our 8000 students and more than 500 employees, Aarhus School of Business and Social Sciences, Aarhus University is among the ten largest EQUIS-accredited business schools in Europe. We are educating the leaders of tomorrow. We have a strong international research and study environment and an extensive range of executive programmes. All our programmes aim to prepare tomorrow's leaders and specialists to think focus on intelligent growth, innovation and sustainability. Through our partnerships with a wide range of Danish companies, we ensure that our programmes and activities are relevant and meet the demands of both Danish and international companies and organizations. The global financial crisis and climate crisis has created a new awareness of the need to find long term solutions that are sustainable - economically, socially and environmentally. With a focus on sustainable growth through innovation, Aarhus School of Business and Social Sciences, Aarhus University wants to contribute to solving these global issues. “Sustainable growth through innovation” represents a mindset for our priorities and acts as a focus of our research as well as a recurring element in our education and communication. ",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "Denmark",
        "University": "University of Copenhagen",
        "Description": "Copenhagen Business School (CBS) is a large business university with 19,000 full- and part time students. CBS teaches the traditional courses in Economics, Management and Business Administration but is also well known for the cross-disciplinary research and teaching, and students can combine business with for example philosophy, political science, psychology or communication. CBS is internationally accredited by AACSB, EQUIS and AMBA, the “triple-crown” accreditation. The CBS campus is an urban campus located in Frederiksberg, an integrated part of Copenhagen. Our buildings are modern and we have state-of the-art facilities. Our campus is connected to the airport and downtown Copenhagen with three on-campus Metro stops.",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "Denmark",
        "University": "Copenhagen Business School",
        "Description": "Copenhagen Business School (CBS) is a large business university with 19,000 full- and part time students. CBS teaches the traditional courses in Economics, Management and Business Administration but is also well known for the cross-disciplinary research and teaching, and students can combine business with for example philosophy, political science, psychology or communication. CBS is internationally accredited by AACSB, EQUIS and AMBA, the “triple-crown” accreditation. The CBS campus is an urban campus located in Frederiksberg, an integrated part of Copenhagen. Our buildings are modern and we have state-of the-art facilities. Our campus is connected to the airport and downtown Copenhagen with three on-campus Metro stops.",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "Denmark",
        "University": "IT University of Copenhagen",
        "Description": "Copenhagen Business School (CBS) is a large business university with 19,000 full- and part time students. CBS teaches the traditional courses in Economics, Management and Business Administration but is also well known for the cross-disciplinary research and teaching, and students can combine business with for example philosophy, political science, psychology or communication. CBS is internationally accredited by AACSB, EQUIS and AMBA, the “triple-crown” accreditation. The CBS campus is an urban campus located in Frederiksberg, an integrated part of Copenhagen. Our buildings are modern and we have state-of the-art facilities. Our campus is connected to the airport and downtown Copenhagen with three on-campus Metro stops.",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "Finland",
        "University": "Aalto University School of Business",
        "Description": "Established in 1911, the Aalto University School of Business is the largest and leading business university in Finland, offering the most comprehensive range of degrees in business administration. Aalto University was the first university among the Nordic countries to receive the 'triple crown' accreditation by all three organizations - AACSB, AMBA, EQUIS - that certify business schools. It is also a proud member of the Community of European Management Schools (CEMS) and Programme for International Management (PIM), and participates in the European Erasmus Programme and the NOREK network, which is a part of the Nordic Nordplus Programme",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "Finland",
        "University": "Hanken School of Economics",
        "Description": "HANKEN's origins date back to 1909, when it was founded by members of the local business community 'as the most advanced institution in Finland with instruction in the Swedish language'. Today, the School is one of Finland's three business schools of university standing. The right to award doctoral degrees was acquired in 1944. The School operates in Helsinki, where a substantial portion of Finland's business is located, and in Ostrobotnia on the west coast, where small and medium sized business predominates - and where many of Finland's Swedish-speakers live. The School also enjoys both high national and international accreditations and has close ties with Finnish hightech and other world-class industry while conducting extensive research operations. The name 'HANKEN' is a nickname for the Swedish name of the school 'Svenska handelshögskolan'. Hanken has been a state-funded institution since 1975 and along with nineteen other Finnish universities is under the supervision of the Ministry of education. Student population: 2,400; Faculty: 135.",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "France",
        "University": "ESCP Europe",
        "Description": "Founded in 1819, ESCP Europe is the oldest business school in the world. From very early on, their alumni have carried the School’s values of excellence, humanism and an open exchange of ideas far beyond the borders of France. ESCP Europe offers a large scale of graduate programmes (Masters and Specialised Masters) and executive programs (Executive MBA, custom and open enrolment programs) on 5 European campuses with a network of 60 international partners. Symbolising our five campuses (Paris, London, Berlin, Madrid and Turin) as well as our European ambition, it has been integrated into their revamped website. Please visit us at www.escpeurope.eu. Staying true to humanist principles and anticipating the new course of the world is the European creed and ESCP Europe’s ambition. Our new name and logo translate our history, our values and our future.",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "France",
        "University": "ESSEC Business School",
        "Description": "Founded in 1819, ESCP Europe is the oldest business school in the world. From very early on, their alumni have carried the School’s values of excellence, humanism and an open exchange of ideas far beyond the borders of France. ESCP Europe offers a large scale of graduate programmes (Masters and Specialised Masters) and executive programs (Executive MBA, custom and open enrolment programs) on 5 European campuses with a network of 60 international partners. Symbolising our five campuses (Paris, London, Berlin, Madrid and Turin) as well as our European ambition, it has been integrated into their revamped website. Please visit us at www.escpeurope.eu. Staying true to humanist principles and anticipating the new course of the world is the European creed and ESCP Europe’s ambition. Our new name and logo translate our history, our values and our future.",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "France",
        "University": "HEC School of Management",
        "Description": "Throughout its 125 years of history, HEC School of Management has continually attracted a special kind of individual highly capable and talented, innovative, entrepreneurial, ambitious and open minded. HEC‘s aim is to train the world leaders of tomorrow. Located in the heart of the thriving, diverse Paris business community, the school has earned international acclaim for its superior programs, groundbreaking research, and outstanding student body. Among the top business schools in Europe, HEC ranks first in France holding the Triple Crown Accreditation from: The Association of MBAs, EQUIS and The American Accreditation AACSB. ",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "France",
        "University": "Sciences Po - Paris Campus",
        "Description": "Sciences Po is a public research and higher education institution in Paris, France, which specializes in social sciences, politics and international affairs. Established in 1872, Sciences Po has traditionally educated France's political and diplomatic elite, and it is widely considered to be one of the world's most reputable and prestigious schools of the social sciences. Sciences Po maintains faculties in political science as well as economics, history, sociology, law, finance, business, communication, social and urban policy, management and journalism.",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "France",
        "University": "Universite Paris-Dauphine",
        "Description": "The University of Paris-Dauphine was founded in 1968, to promote teaching and research about private and public organizations. The University of Paris-Dauphine is a multidisciplinary institution. It is constantly advancing in a wide range of fields such as Management, Economics, Data Processing and Computer Sciences, computer Sciences for Management, Applied Mathematics and Law.",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "France",
        "University": "Sciences Po - Reims Campus",
        "Description": "Sciences Po is a public research and higher education institution in Paris, France, which specializes in social sciences, politics and international affairs. Established in 1872, Sciences Po has traditionally educated France's political and diplomatic elite, and it is widely considered to be one of the world's most reputable and prestigious schools of the social sciences. Sciences Po maintains faculties in political science as well as economics, history, sociology, law, finance, business, communication, social and urban policy, management and journalism.",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "France",
        "University": "NEOMA Business School - Rouen Campus",
        "Description": "Established in 1928, the NEOMA Business School – Reims Campus (previously known as Reims Management School) is a French Business school with a strong international dimension and promotes cultural diversity. On 24 April 2013, Rouen Business School and Reims Management School announced the merger of the two Schools into a single entity. The new school will be jointly headed by its Chairman, Yves Bénard (the former Chairman of Reims Management School) and its Dean, Frank Bostyn. NEOMA Business School has a dual purpose: to be ranked among the best European schools, and to be recognized as a key corporate partner. In order to serve the interests of all its stakeholders as well as possible, the new entity will leverage the skills and strengths that have made excellence the hallmark of both founding Schools. ",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "France",
        "University": "Toulouse Business School",
        "Description": "Founded in 1903 by the Toulouse Chamber of Commerce and Industry, the school's initial vocation was to respond to the needs of the local business community for able business administrators. Originally housed in a 15th century monastery located in the old town centre, the School's present premises include a downtown campus and an ultra-modern 'electronic' campus located on the perimeter of the city. The downtown campus, a blend of aesthetic architectural harmony and functional excellence, is located at the heart of the business complex near the centre of metropolitan Toulouse. Among the top business schools in France and in Europe, ESC Toulouse holds the Triple Crown Accreditation: AMBA (The Association of MBAs); the European accreditation EQUIS from EFMD; the American Accreditation AACSB. ",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "Germany",
        "University": "Freie Universität Berlin",
        "Description": "Freie Universität Berlin was founded by students and scholars on December 4, 1948, with the support of the American Allies and Berlin politicians as a response to the persecution of students critical of the system at Universität Unter den Linden in the Soviet sector of the divided city of Berlin. These students and scholars wanted to study and carry out research at Freie Universität, free of political influence. Thanks to generous donations from the United States, Freie Universität was able to construct several new central building complexes including the Benjamin Franklin university clinic complex and the Henry Ford Building, the central lecture building. Based on its founding tradition, Freie Universität’s seal to this day bears the Latin terms for Truth, Justice, and Liberty. The foundation of Freie Universität Berlin was facilitated through international support, and international impulses have shaped its research ever since. Currently, Freie Universität has over 130 partnerships with scholarly institutions worldwide. The university is a drawing card for international researchers. Freie Universität and Ludwig-MaximiliansUniversität München are the two most often selected locations for visiting scholars through the Alexander von Humboldt Foundation. About 600 foreign scholars contribute to the diversity in research and teaching. Of its approximately 31,000 students in over 100 subject areas, 16 percent come from abroad. ",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "Germany",
        "University": "Freie Universität Berlin Law School - Themis",
        "Description": "Freie Universität Berlin was founded by students and scholars on December 4, 1948, with the support of the American Allies and Berlin politicians as a response to the persecution of students critical of the system at Universität Unter den Linden in the Soviet sector of the divided city of Berlin. These students and scholars wanted to study and carry out research at Freie Universität, free of political influence. Thanks to generous donations from the United States, Freie Universität was able to construct several new central building complexes including the Benjamin Franklin university clinic complex and the Henry Ford Building, the central lecture building. Based on its founding tradition, Freie Universität’s seal to this day bears the Latin terms for Truth, Justice, and Liberty. The foundation of Freie Universität Berlin was facilitated through international support, and international impulses have shaped its research ever since. Currently, Freie Universität has over 130 partnerships with scholarly institutions worldwide. The university is a drawing card for international researchers. Freie Universität and Ludwig-MaximiliansUniversität München are the two most often selected locations for visiting scholars through the Alexander von Humboldt Foundation. About 600 foreign scholars contribute to the diversity in research and teaching. Of its approximately 31,000 students in over 100 subject areas, 16 percent come from abroad. ",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "Germany",
        "University": "Humboldt-Universität Zu Berlin",
        "Description": "The university was founded in Berlin in 1810, and the foundation concept of Wilhelm von Humboldt gave it the title 'Mother of all modern universities'. From the outset, the university in Berlin had the four classical faculties of Law, Medicine, Philosophy and Theology. Its first academic term began with 256 students and 52 teaching staff. Professors such as Georg Friedrich Wilhelm Hegel (Philosophy), Karl Friedrich von Savigny (Law), August Boeckh (Classical Philology), Christoph Wilhelm Hufeland (Medicine) and Albrecht Daniel Thaer (Agriculture), shaped the profile of the individual faculties in accordance with Humboldt's concept. The University currently maintains formal contacts to nearly 100 academic institutions on all continents, and holds more than 400 formal contracts within the Socrates Program. Students from over 100 different foreign countries are presently enrolled at Humboldt-Universität.",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "Germany",
        "University": "Goethe-University Frankfurt am Main",
        "Description": "Goethe-University Frankfurt am Main is a lively, urban, and cosmopolitan university that provides an excellent atmosphere in which to research, study, think and create. The university was founded in 1914 through private funding. Thus, the university owes its establishment to the link – which is characteristic for the city of Frankfurt – between dynamic research, the legacy of the Enlightenment, and the conscious commitment of the citizens of Frankfurt to the fundamentals of international trade and industry. With 35,000 enrolled students, 600 Professors, as well as academic and non-academic staff on four campuses, Frankfurt University ranks among the major universities in Germany. ",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "Germany",
        "University": "University of Konstanz, Germany",
        "Description": "Top-level research, excellence in teaching and studies, internationality and interdisciplinary collaboration have stood for the University of Konstanz since its foundation as a Reform University in 1966. The University of Konstanz is a modern campus university with a clearly-defined, excellent profile. We offer study programmes in the fields of mathematics and natural science; humanities; politics; law and economics. With 1,300 students from over 90 countries worldwide, we’re proud to call the University of Konstanz a truly international community. The city of Konstanz and Lake Constance offer a wide range of recreational activities.",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "Germany",
        "University": "University of Mannheim",
        "Description": "The University of Mannheim emerged from the state college of economics which was originally the college of commerce. In 1967, following the addition of broader subjects the college was extended to a university. The University of Mannheim has an impressive profile to offer its students and visitors. At the heart of the university are the faculties of Business and Social Sciences. In these two fields, the University of Mannheim ranks among the best universities in Germany. The other existing faculties offered – Law, Humanities, Mathematics and Computer Science – not only reflect a high level themselves but are also interdisciplinary with the Business & Social Sciences. On an international level, Mannheim holds the 1st AACSB (The International Association for Management Education) as an accredited School of Business Administration. ",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "Germany",
        "University": "University of Mannheim - Department of Law",
        "Description": "The University of Mannheim emerged from the state college of economics which was originally the college of commerce. In 1967, following the addition of broader subjects the college was extended to a university. The University of Mannheim has an impressive profile to offer its students and visitors. At the heart of the university are the faculties of Business and Social Sciences. In these two fields, the University of Mannheim ranks among the best universities in Germany. The other existing faculties offered – Law, Humanities, Mathematics and Computer Science – not only reflect a high level themselves but are also interdisciplinary with the Business & Social Sciences. On an international level, Mannheim holds the 1st AACSB (The International Association for Management Education) as an accredited School of Business Administration. ",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "Germany",
        "University": "University of Mannheim ‚Äì School of Business Informatics and Mathematics",
        "Description": "The University of Mannheim emerged from the state college of economics which was originally the college of commerce. In 1967, following the addition of broader subjects the college was extended to a university. The University of Mannheim has an impressive profile to offer its students and visitors. At the heart of the university are the faculties of Business and Social Sciences. In these two fields, the University of Mannheim ranks among the best universities in Germany. The other existing faculties offered – Law, Humanities, Mathematics and Computer Science – not only reflect a high level themselves but are also interdisciplinary with the Business & Social Sciences. On an international level, Mannheim holds the 1st AACSB (The International Association for Management Education) as an accredited School of Business Administration. ",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "Germany",
        "University": "University of Mannheim School of Social Sciences/Humanities",
        "Description": "The University of Mannheim emerged from the state college of economics which was originally the college of commerce. In 1967, following the addition of broader subjects the college was extended to a university. The University of Mannheim has an impressive profile to offer its students and visitors. At the heart of the university are the faculties of Business and Social Sciences. In these two fields, the University of Mannheim ranks among the best universities in Germany. The other existing faculties offered – Law, Humanities, Mathematics and Computer Science – not only reflect a high level themselves but are also interdisciplinary with the Business & Social Sciences. On an international level, Mannheim holds the 1st AACSB (The International Association for Management Education) as an accredited School of Business Administration. ",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "Germany",
        "University": "Ludwig-Maximilians-Universität",
        "Description": "People come to LMU Munich seeking its unique academic diversity. Its 18 faculties give around 700 professors and 3,000 academic staff room to research and teach. They offer a wide and well-rounded range of learning opportunities that cover all areas, whether humanities and culture studies, law, economics and sociology, or medicine and the sciences. LMU Munich takes the education of young people very seriously. When they speak of academic diversity, they also mean a comprehensive education that encompasses social skills alongside a critical awareness of values and history. This includes the Munich legacy of the Weisse Rose, the student-based resistance group that opposed Nazism. ",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "Germany",
        "University": "Technische Universitat Munchen",
        "Description": "The TUM first saw the light of day in 1868 in the form of the independent “Royal Polytechnic” founded by King Ludwig II. As Carl Max von Bauernfeind, its first rector said in his inauguration address, the establishment was founded to “bring the vitalizing sparks of science to bear on technology”. TUM has now 20,000 students and three campuses in Munich. TUM holds a leading place in many respects: it is ranked foremost among German universities in terms of both total research grant turnover (approx. € 130million in 1999) and the number of guest researchers from all over the world, working at TUM with the support of the Alexander von Humboldt Foundation. ",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "Germany",
        "University": "European Business School - Germany",
        "Description": "Founded in 1971, EBS is the oldest private Business School with state accredited university status. The programs in Business Administration and Information Systems as well as business law combine sound academic foundations with a powerful international dimension in their commitment to meet the needs of tomorrow’s managers. Leading business companies like DaimlerChrysler, Porsche AG, Deutsche Bank AG, among many others, support EBS. EBS stands among vineyards of the Rhine-Valley and within easy reach of Frankfurt, Europe’s financial capital and Frankfurt International Airport. In geographical terms, EBS is at the centre of Europe. ",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "Germany",
        "University": "Universität Tübingen",
        "Description": "The University of Tübingen was founded in 1477 by Count (later Duke) Eberhard im Bart. In 1534 Duke Ulrich I of Wuerttemberg brought the Reformation to Tübingen, and two years later established a Protestant Theological Seminary, the Tübingen Stift, as an academic bastion of the new faith in Southern Germany. This theological institution has been of particular importance in establishing the University's reputation, and has had a significant influence on the course of German intellectual history, particularly in the 18th and 19th centuries. More recently, the medical and natural sciences centers moved up to the hills north of the city center. The University of Tübingen consolidated its reputation as one of the outstanding universities in Europe.",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "Germany",
        "University": "WHU - Otto Beisheim School of Management",
        "Description": "The WHU Koblenz, a private university, was founded in 1984 by the business community for the business community. It is the first school in Germany to offer courses in business administration which focus corporate management. State-accredited, with full university status, it offers an eight-semester programme in business management (Betriebswirtschaftslehre) and a weekend Executive MBA Programme. The WHU Koblenz is located in Vallendar, near the city of Koblenz. ",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "Iceland",
        "University": "University of Iceland",
        "Description": "The University of Iceland was founded on 17 June 1911, on the centenary of 19th-century Icelandic statesman Jón Sigurðsson, usually referred to as 'president'. The University of Iceland is a progressive educational and scientific institution, renowned in the global scientific community for its research. It is a state university, situated in the heart of Reykjavík, the capital of Iceland. A modern, diversified, and rapidly developing institution, the University of Iceland offers opportunities for study and research in over 400 programmes spanning most fields of science and scholarship: Social Sciences, Health Sciences, Humanities, Education, Natural Sciences and Engineering. ",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "Ireland",
        "University": "Trinity College Dublin",
        "Description": "Founded in 1592, Trinity is at the nexus of tradition and innovation, offering undergraduate and postgraduate programmes across 24 schools and three faculties: arts, humanities, and social sciences; engineering, mathematics and science; and health sciences. Spread across 47 acres in Dublin's city centre, Trinity's 17,000-strong student body comes from all 32 counties of Ireland, and 16% of students come from outside the country. ",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "Ireland",
        "University": "University College Dublin",
        "Description": "With over 20,000 students and almost 2500 academic staff, University College Dublin is Ireland’s largest and most influential university. Its 2000 international students also give the university an international atmosphere and reputation. The university dates its origin from the foundation in 1851 of the Catholic University of Ireland. It opened officially in 1854. Some of the more celebrated literary figures associated with the early days of the University are the poets Gerard Manley Hopkins and Austin Clarke, and the world famous novelist James Joyce.",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "Ireland",
        "University": "University College Dublin Sutherland School of Law",
        "Description": "Ranked one of the Top 100 Universities in the World for Law, UCD Sutherland School of Law is the leading centre for legal education and research in Ireland. It is committed to the development and creation of new initiatives, to enriching the educational environment of its student body, to working in partnership with the practising legal profession and to establishing a major, well-regarded and authoritative presence in the international legal community. It also offers visiting students the opportunity to study and immerse themselves in the largest Law School in Ireland. The School has an exceptional academic community where students enjoy direct engagement with experts in the field who are at the cutting edge of teaching and research. UCD Sutherland School of Law is part of the University College Dublin which is a vibrant, modern university with around 24,000 students and is located on a spacious and leafy campus some 5km to the south of Dublin city centre.",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "Italy",
        "University": "Universitàt Carlo Cattaneo - LIUC",
        "Description": "LIUC Universita Cattaneo Castellanza is named after Carlo Cattaneo, a 19th century local thinker and economist. It is a state recognized university that has developed rapidly since its establishment in 1991. It was founded on the initiative of the Industrial Association of the Province of Varese (UNIVA) and it was immediately recognized for the close relationship it has with the business world. Today its three Faculties – Economics, Engineering and Law – are open to a limited number of students (about 3,000 in total). All courses are interdisciplinary with cross-faculty teaching in order to provide students with a broad based education and overall understanding of the different business functions.",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "Italy",
        "University": "Bocconi University",
        "Description": "Università Bocconi is considered one of Europe’s leading educational institutions in Economics, Management, Finance and Law. Our business school was ranked 7th in Europe according to the Financial Times European Business School Rankings 2011, the MSc in International Management is 23rd worldwide according to the Financial Times Masters in Management Rankings 2012 and the full-time MBA was ranked 28th worldwide according to the Financial Times Global MBA Rankings 2011. Bocconi is a member of two important international exchange networks, the Partnership in International Management (PIM) and The Global Alliance in Management Education (CEMS). In addition to these networks Bocconi has bilateral agreements with about 200 top-ranked partner schools worldwide and exchanges more than 1200 students every year. ",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "Italy",
        "University": "Universita degli Studi Di Milano",
        "Description": "The University of Milan is a public, multidisciplinary teaching and research institution that offers 8 Faculties, 2 Schools, 136 study courses, 31 Doctoral Programmes and 63 Specialisation Schools. Our 2000 professors represent the highest concentration of scientific expertise in the region and our research is ranked among the best in Italy and Europe.",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "Italy",
        "University": "Libera Università Internazionale degli Studi Sociali Guido Carli",
        "Description": "LUISS is an independent university. Through its Faculties of Economics, Law and Political Science (and its three Departments of Historical and Socio-political Science, Economics and Business Administration and Law) it offers an educational model that aims to achieve effective integration between the university and production systems. LUISS exercises a constant collaboration, dialogue and exchange with all players participating in the educational process: academics, researchers, young people, businesses and institutions. LUISS has 5,800 students; 750 faculty members; an average of 180 students studying overseas and an increasing number of foreign exchange students on campus. ",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "Lithuania",
        "University": "Vilnius University",
        "Description": "Vilnius University founded in 1579, is the oldest university in the Baltic States and one of the oldest and most famous establishments of higher education in Eastern and Central Europe. It is also the largest University in Lithuania. Functioning for a long time as the only school of higher learning in Lithuania, it was a preserver of cultural and scientific traditions, and has played a significant part in the cultural life not only of Lithuania, but the neighboring countries as well. During more than four centuries of its existence, the University of Vilnius has seen periods of growth and decline, revival, and closure. The University is a unique witness to the history of the Lithuanian state.",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "Netherlands",
        "University": "VU University Amsterdam",
        "Description": "Amsterdam, the capital of the Netherlands, has been a renowned cultural, scientific and commercial centre for many centuries. It was here, in 1880, that VU University Amsterdam first opened its doors to students. VU stands for 'Vrije Universiteit' which means 'Free University'. Here, 'free' refers to freedom from state and church interference Throughout the past century, the University has expanded and now comprises twelve faculties and has teaching facilities for 23,000 students. The University campus and university hospital are situated in the south-western part of Amsterdam, one of the most dynamic and fast-growing business districts in the Netherlands and the financial heart of Amsterdam. With over fifty undergraduate programmes and almost a hundred postgraduate programmes, VU University Amsterdam offers a wide range of high quality academic programmes in a stimulating environment.",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "Norway",
        "University": "Norwegian School of Economics",
        "Description": "The Norwegian School of Economics (NHH) was founded in 1936. The School represents Norway’s largest and most prestigious center of research and education with these subject areas. NHH is a full-scale business school with programs of study ranging from evening classes to doctoral level courses in business administration, finance, economics and management. It has over 2,800 full time students and a total staff of more than 330. The school co-operates closely with the Administrative Research Institute and the Institute of Research in Economics & Business Administration at NHH. Together, NHH and its associated institutes constitute a major academic organizational entity with more than 470 employees. NHH is located in beautiful Bergen, the capital of Western Norway, and gateway to the fjords. "
    },
    {
        "Continent": "Europe",
        "Country": "Norway",
        "University": "BI Norwegian Business School",
        "Description": "The BI Norwegian Business School was established in Oslo in 1943 as a privately-owned institution – seven years after the Norwegian government founded the country’s first school of higher education in business and economics. The original name of the BI Norwegian Business School was “Bedriftsokonomisk Institutt”, or BI, which are the initials still associated with the school. As a rule, higher public education in Norway is fully financed by the government. As a private, non-profit foundation, however, NSM BI receives little public funding and is largely dependent on tuition, research grants, and co-operative programmes with the business community. The campus is situated at Schous, in the center of Oslo."
    },
    {
        "Continent": "Europe",
        "Country": "Poland",
        "University": "University of Economics in Katowice",
        "Description": "The high quality of teaching in the University of Economics in Katowice study programmes, both on bachelor and master level, has been confirmed by accreditation certificates awarded by the Accreditation Committee of the Foundation for the Promotion and Accreditation of Economic Education in Warsaw. The following study programmes have been awarded quality of education certificates: Management and Marketing, Informatics and Econometrics, Economics, Finance and Banking. Moreover, Management and Marketing has been awarded a quality of education certificate by the State Accreditation Committee. "
    },
    {
        "Continent": "Europe",
        "Country": "Poland",
        "University": "Kozminski University",
        "Description": "Since its beginnings (1989) the LKAEM has been committed to educating students in a wide range of businessrelated areas. Its pursuit of excellence was recognized and rewarded when in 1997 the prestigious annual list of Poland’s business schools published by the Wprost magazine ranked them as the best among the private institutions of higher education, and second among over 100 Polish business schools. The LKAEM employs outstanding scholars from Poland and from abroad, and is frequently visited by distinguished professors, including Nobel Prize winners as well as distinguished members of the business community & political leaders. LKAEM offers 7 programmes entirely taught in English, out of which 3 are undergraduate level. "
    },
    {
        "Continent": "Europe",
        "Country": "Poland",
        "University": "Warsaw School of Economics",
        "Description": "Warsaw School of Economics is the oldest and most prestigious economic school in Poland as well as one of the leading universities of economics and management in Central and Eastern Europe. It started its activities on 13th October 1906 under the name of 'August Zieliński’s Private Trade Courses for Men' during the time of the Russian occupation. Since the school was established, it has educated almost 70,000 graduates and awarded over 1,700 PhD degrees in Economics and Management. At present, there are more than 15,000 students and 923 academic teachers. "
    },
    {
        "Continent": "Europe",
        "Country": "Poland",
        "University": "Universidade Católica Portuguesa, CATÓLICA-LISBON - School of Business and Economics",
        "Description": "CATÓLICA-LISBON is the only Portuguese Business School among Europe's Top 25 and is one of the less than 1% of business schools worldwide to be accredited by all three management education associations - EQUIS, AMBA and AACSB - and is the first and sole Portuguese Business School ranked in the Financial Times Executive Education Rankings. In 2009, CATÓLICA-LISBON was ranked as 37th best in the world and 17th best in Europe."
    },
    {
        "Continent": "Europe",
        "Country": "Poland",
        "University": "Universidade Nova de Lisboa",
        "Description": "The Universidade Nova de Lisboa was founded in 1973 within a framework of expansion and diversification in Portuguese higher education. Following its first 4 years of existence, the initial model was adapted in order to carry out the University’s commitment towards excellence in teaching and research. At present, NOVA consists of 5 Faculties, 3 Institutes and 1 School. It awards undergraduate degrees in around 40 areas and offers 65 Masters, 20 PhDs and 44 Postgraduate degree programmes. It also has 49 research centers financed by the Portuguese Foundation for Science and Technology. Total student population: 14,200 (1,400 in graduate programmes)"
    },
    {
        "Continent": "Europe",
        "Country": "Russia",
        "University": "Lomonosov Moscow State University Business School",
        "Description": "Lomonosov Moscow State University Business School (Lomonosov MSU BS) founded in 1989 in Moscow State University is one of the oldest business schools in Russia. Lomonosov MSU BS’s programmes (Bachelor in Business Administration, Master in International Business, MBA and Executive MBA Programs; Doctoral Program) are designed to meet the most refined demands of Russian and foreign students of all levels. Lomonosov MSU BS melts academic traditions of MSU with innovative techniques of teaching business and management. Having strong connections with Russian business world, Lomonosov MSU BS also offers tailor-made corporate programmes. The ambition to be the best is rewarded by our graduates’ recognition – Lomonosov MSU BS is ranked #1 in Russia according to the 2007 and 2008 year surveys held by the leading business magazine 'Secret Firmy' (¹37 (269), 2008; ¹36 (219), 2007). "
    },
    {
        "Continent": "Europe",
        "Country": "Russia",
        "University": "National Research University Higher School of Economics (HSE)",
        "Description": "The National Research University Higher School of Economics (HSE) is one of the leading and largest universities in Russia.The university specializes in economics, social sciences, mathematics, computer science, media communications and design. It has more than twenty departments, with its main campus located in Moscow and three additional campuses in St. Petersburg, Nizhniy Novgorod and Perm. The university has established and maintained connections with international research and educational institutions including the London School of Economics, the Erasmus University Rotterdam, DAAD and many others. HSE is recognized as one of the top three universities in Russia, alongside Lomonosov Moscow State University and MGIMO (Moscow State Institute of International Relations). "
    },
    {
        "Continent": "Europe",
        "Country": "Russia",
        "University": "Plekhanov Russian University of Economics",
        "Description": "The Plekhanov is the largest economic institution of higher education in Russia and the former Soviet Union. It was founded in 1907 and, was at that time, the only university at which women were permitted to study. Among the founders was Viashnikov, merchant of the first guild together with members of other distinguished dynasties such as the Abrikosovs, the Smirnovs, and others. It all started with a group of only 50 students. Today there are more than 13,000 students in the Academy. The Plekhanov diploma is certified by UNESCO. This international recognition is underlined by double diploma agreements with universities in the Netherlands, Britain, Denmark and the United States of America. "
    },
    {
        "Continent": "Europe",
        "Country": "Russia",
        "University": "Saint Petersburg State University, Graduate School of Management",
        "Description": "The Graduate School of Management, GSOM is one of the 22 schools (faculties) of Saint Petersburg State University. It was founded in 1993 as School of Management later renamed to preserve consistency into Faculty of Management. In 2005, it was chosen to become a part of the National Priority Project in Education aimed at creating two leading business schools in Russia. Saint Petersburg State University, is a Russian federal stateowned higher education institution based in Saint Petersburg. It is the oldest and one of the largest universities in Russia. "
    },
    {
        "Continent": "Europe",
        "Country": "Spain",
        "University": "ESADE",
        "Description": "ESADE was founded in 1958 by a group of business persons in collaboration with the Society of Jesus (Jesuits). It subsequently became a civil foundation, after the restoration of democracy in Spain. With more than 45 years of experience, ESADE today is one of the most prestigious universities in Europe and offers a wide range of programmes, adapted to the most diverse training needs: university courses, postgraduate courses, different formats of MBA and Doctoral programmes. On 2nd February 2009, the ESADE undergraduate, MSc and PhD Business Programmes had moved to their new Campus Barcelona-Sant Cugat, 15 km from Barcelona on the other side of the Collserola mountain range and Natural Park."
    },
    {
        "Continent": "Europe",
        "Country": "Spain",
        "University": "ESADE Law School",
        "Description": "ESADE was founded in 1958 by a group of business persons in collaboration with the Society of Jesus (Jesuits). It subsequently became a civil foundation, after the restoration of democracy in Spain. With more than 45 years of experience, ESADE today is one of the most prestigious universities in Europe and offers a wide range of programmes, adapted to the most diverse training needs: university courses, postgraduate courses, different formats of MBA and Doctoral programmes. On 2nd February 2009, the ESADE undergraduate, MSc and PhD Business Programmes had moved to their new Campus Barcelona-Sant Cugat, 15 km from Barcelona on the other side of the Collserola mountain range and Natural Park."
    },
    {
        "Continent": "Europe",
        "Country": "Spain",
        "University": "Universitat Autonoma de Barcelona",
        "Description": "In its mission, the Universitat Autònoma de Barcelona defines itself as a public Catalan university with an international outlook. For the university, internationalisation is one of the tools to achieve its objectives in offering quality education, research and knowledge transfer. Our internationalisation strategy is based on three fundamental lines of action: mobility, collaboration and cooperation, and the attraction of talent. Mobility must give our students, lecturers and administration staff the chance to work in prestigious universities mainly through exchange programmes. Collaboration with other universities and institutions must permit students and lecturers to discover and propose new teaching experiences and open new fields of research together with other prestigious universities. Cooperation with developing countries contributes to the construction of a more solidary university committed to social reality. Attraction of talent aims to select the best students, especially at the master's degree and PhD level, and attract the best lecturers from around the world. To foster these objectives we place special importance on strategic alliances with other universities through a variety of consortiums and networks."
    },
    {
        "Continent": "Europe",
        "Country": "Spain",
        "University": "Universitat Pompeu Fabra",
        "Description": "Universitat Pompeu Fabra is inspired by the principles of freedom, democracy, justice, equality and independence within the context of a plural society. It is committed to training first-rate professionals and turning out citizens who will uphold the highest social values. UPF is also unwavering in its pursuit of research excellence. It is a city university engaged in the active, dynamic life of the city of Barcelona, and a university that is wide open to the world beyond. Public, city-based, and cosmopolitan: those are the values that identify UPF as an institution working in the service of society. Universitat Pompeu Fabra is named after the man who laid down the standards of the modern Catalan language. "
    },
    {
        "Continent": "Europe",
        "Country": "Spain",
        "University": "Universidad Carlos III de Madrid",
        "Description": "Universidad Carlos III de Madrid is a Spanish public university that, in its 18 years, has attained recognized prestige for their high level of education. Carlos III is the only Spanish University in which ALL of its PhD programmes have received the “Mencion de Calidad” (a hallmark award certifying the high quality of a programme) from the Ministry of Education and Science. The outstanding full-time Carlos III faculty, many of whom hold PhDs from top universities in the U.S. and Europe, reflect the highest percentage of university professors receiving favourable evaluations from the MEC (Ministry of Education and Science). In addition, Carlos III University ranks number one in Spain for research competitiveness according to the COTEC report, with some of its scientific research areas rated among the best in Europe in international rankings."
    },
    {
        "Continent": "Europe",
        "Country": "Spain",
        "University": "Universidad Pontificia Comillas de Madrid",
        "Description": "Pope Leo XIII founded the Seminary of San Antoni de Padua in 1890 in the town of Comillas (province of Santander, Spain) in response to efforts made by the Marquis of Comillas to build an institution for educating candidates to the priesthood. At the time of its foundation, the Seminary was entrusted to the Society of Jesus. In 1904, the Universidad Pontificia was established when Pope Pius X granted “COMILLAS” the power to confer academic degrees in Theology, Philosophy and Canon Law. During the sixties the University was transferred to Madrid. Currently, Comillas has 7,700 undergraduates & 4,300 students in special or post-graduate study. There are over 1,000 foreign students in Comillas & 1,882 full time & part-time teachers. The university has Faculties of Theology, Canon Law, Human & Social Sciences, Law & Business Administration & Economics, the “Escuela Tecnica Superior de Ingeniera, ICAI” as well as the Schools of Nursing & Physiotherapy. "
    },
    {
        "Continent": "Europe",
        "Country": "Spain",
        "University": "IE University",
        "Description": "IE University is the No. 1 University in Spain, No. 12 in Europe and No. 34 worldwide in the Global Employability Survey and University Ranking 2013 published by US daily International New York Times. IE University is for students who believe that learning is a way of life and are open to the transforming role of higher education. IE University is marked by its international campus, entrepreneurial spirit, pioneering initiatives, and commitment to educate young professionals and experts for an international vocation, able to make a positive impact on society. IE University creates a specific learning environment based on our values of academic rigor, the integration of different fields of knowledge, both theoretical and practice based; a humanistic education and personalized guidance. IE University holds a leading position in Europe among institutions of higher education for excellence in innovation and learning technologies. In addition, its undergraduate programs are recognized by the most prestigious associations in their respective fields, and highly regarded by employers of leading corporations."
    },
    {
        "Continent": "Europe",
        "Country": "Sweden",
        "University": "University of Gothenburg",
        "Description": "The University of Gothenburg has approximately 50,000 students and 5,000 employees. It is one of the largest universities in Scandinavia. With its eight faculties and approximately sixty departments, the University of Gothenburg is also the most wide-ranging and versatile university in Sweden, offering unique opportunities for cooperation and development. The distinctive characteristic of university education at the University of Gothenburg is the close interaction between teaching and research. Students are kept informed of the latest developments in the field they are studying and researchers gain inspiration from their students’ expectations and needs. At the University of Gothenburg research and teaching are regarded as equally important, and there is ongoing pedagogical development work. In an international perspective too, the University of Gothenburg is comprehensive, with cutting-edge research in a number of dynamic research areas. "
    },
    {
        "Continent": "Europe",
        "Country": "Sweden",
        "University": "Jonkoping International Business School",
        "Description": "At Jönköping University there are four different schools. All schools offer courses in English for international students. All of the academic programmes focus on SME and entrepreneurship in their activities and courses. The education is delivered in English, and you will be integrated in the same courses and share the same accommodation with Swedish students "
    },
    {
        "Continent": "Europe",
        "Country": "Sweden",
        "University": "Lund University",
        "Description": "Lund University was founded in 1666, partly in order to knit the provinces which had been ceded by Denmark in 1658 closer to Sweden. Since then, the University has developed into a modern international centre for research and higher education. At present, more than 34 000 students are enrolled at Lund University and altogether some 6000 people are employed."
    },
    {
        "Continent": "Europe",
        "Country": "Sweden",
        "University": "KTH Royal Institute of Technology",
        "Description": "KTH Royal Institute of Technology in Stockholm is the largest and oldest technical university in Sweden. No less than one-third of Sweden’s technical research and engineering education capacity at university level is provided by KTH. Education and research spans from natural sciences to all branches of engineering and includes Architecture, Industrial Management and Urban Planning."
    },
    {
        "Continent": "Europe",
        "Country": "Sweden",
        "University": "Stockholm School of Economics",
        "Description": "Stockholm School of Economics is one of Europe’s leading business schools, with a unique business community network. The research is internationally recognized and many researchers are among the leading figures in their respective fields. The school is the only privately funded university in Sweden founded in 1909 on the initiative of Swedish business leaders. SSE has a good reputation and is consistently ranked by the Financial Times as the number 1 business school in the Nordic and Baltic countries."
    },
    {
        "Continent": "Europe",
        "Country": "Sweden",
        "University": "Stockholm University",
        "Description": "Stockholm School of Economics is one of Europe’s leading business schools, with a unique business community network. The research is internationally recognized and many researchers are among the leading figures in their respective fields. The school is the only privately funded university in Sweden founded in 1909 on the initiative of Swedish business leaders. SSE has a good reputation and is consistently ranked by the Financial Times as the number 1 business school in the Nordic and Baltic countries."
    },
    {
        "Continent": "Europe",
        "Country": "Sweden",
        "University": "Uppsala University",
        "Description": "Uppsala University is a leading research university where education grows out of research. In a great number of disciplines Uppsala University is on the international research front. Their long-term commitment is to maintain and reinforce their prominent position. This takes the form of vigorous investments for global excellence in research and education. New cross-disciplinary programs, the creation of new campuses, and growing groundbreaking research are some of the key tools in this ongoing process of rejuvenation. They also strive to stimulate cooperation between higher education, business, and the surrounding community. Today's research and education build on deeply rooted traditions of learning. Living traditions and rich culture are part of their strength. "
    },
    {
        "Continent": "Europe",
        "Country": "Sweden",
        "University": "Uppsala University (Faculty of Law)",
        "Description": "Uppsala University is a leading research university where education grows out of research. In a great number of disciplines Uppsala University is on the international research front. Their long-term commitment is to maintain and reinforce their prominent position. This takes the form of vigorous investments for global excellence in research and education. New cross-disciplinary programs, the creation of new campuses, and growing groundbreaking research are some of the key tools in this ongoing process of rejuvenation. They also strive to stimulate cooperation between higher education, business, and the surrounding community. Today's research and education build on deeply rooted traditions of learning. Living traditions and rich culture are part of their strength. "
    },
    {
        "Continent": "Europe",
        "Country": "Switzerland",
        "University": "University of Geneva",
        "Description": "Founded in 1559 by Jean Calvin, the University of Geneva (UNIGE) is dedicated to thinking, teaching, dialogue and research. With 16’000 students of more than 140 different nationalities, it is Switzerland’s second largest university. UNIGE offers more than 280 types of degrees and more than 250 Continuing Education programmes covering an extremely wide variety of fields: exact sciences, medicine and humanities. Its domains of excellence in research include life sciences (molecular biology, bio-informatics), physics of elementary particles, and astrophysics. UNIGE is also host and co-host to six National Centres of Competence in Research: Frontiers in Genetics, Materials with Novel Electronic Properties (MaNEP), Chemical Biology, Affective Sciences, Synaptic Bases of Mental Diseases and LIVES-Overcoming vulnerabilities in a life course perspective. "
    },
    {
        "Continent": "Europe",
        "Country": "Switzerland",
        "University": "University of Lausanne",
        "Description": "Originally founded as the Académie in 1537, the University of Lausanne (UNIL) is a modern institution that, along with neighboring Ecole Polytechnique Fédérale de Lausanne (EPFL), forms a focal point for higher education and leading research, at not only a local level, but also at a national and international level. With seven faculties (Theology and Religious Studies, Law and Criminal Justice, Arts, Social and Political Sciences, Business and Economics, Geosciences and Environment, Biology and Medicine), the University of Lausanne is a well-rounded university. It is attended by 10’000 students and 2’200 researchers. At the University of Lausanne, student-professor interactions as well as interdisciplinary are encouraged. HEC Lausanne is the affiliated business school of the University of Lausanne. "
    },
    {
        "Continent": "Europe",
        "Country": "Switzerland",
        "University": "University of Lucerne (Faculty of Law)",
        "Description": "The University of Lucerne is a young one. Although its roots reach back to 1600, it has only formed part of Switzerland’s twelve universities since 2000. The University of Lucerne is limited to three faculties and distinguished by a slim and clearly identifiable profile. With its faculties of theology, cultural and social sciences and law, it concentrates on three core areas and thus bundles competence in humanities and trains qualified jurists. The convenient size of the University of Lucerne provides students with a great degree of freedom and innovative combination possibilities. Study courses are offered in traditional subjects as well as in overlapping subjects (integrated); moreover, it is possible to combine elements from different faculties. The excellent support of students is a special feature of the University of Lucerne. "
    },
    {
        "Continent": "Europe",
        "Country": "Switzerland",
        "University": "University of St Gallen",
        "Description": "The University of St. Gallen for Business Administration, Economics, Law and Social Sciences (HSG) was founded in 1898 as a «business academy» and enrolled its first students in 1899. The HSG, which became a business university in 1911, continues to this day to pursue the goal – set at its foundation – of providing for its students a practice- oriented education. When, in 1963, it moved to new accommodation on the Rosenberg, it had some 1,000 students and 27 professors. At the beginning of 1999, there were about 4,500 students (of whom some 23% were women) and over 70 professors. "
    },
    {
        "Continent": "Europe",
        "Country": "Switzerland",
        "University": "University of St Gallen (Faculty of Law)",
        "Description": "The University of St. Gallen for Business Administration, Economics, Law and Social Sciences (HSG) was founded in 1898 as a «business academy» and enrolled its first students in 1899. The HSG, which became a business university in 1911, continues to this day to pursue the goal – set at its foundation – of providing for its students a practice- oriented education. When, in 1963, it moved to new accommodation on the Rosenberg, it had some 1,000 students and 27 professors. At the beginning of 1999, there were about 4,500 students (of whom some 23% were women) and over 70 professors. ",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "Switzerland",
        "University": "University of Zurich",
        "Description": "The University of Zurich (UZH) with its 26,000 enrolled students is Switzerland's largest university. Founded in the year 1833, UZH was Europe's first university to be established by a democratic political system; today, UZH is one of the foremost universities in the German-speaking world. Made up of seven faculties covering some 100 different subject areas, the University offers a wide variety of Bachelor's, Master's and PhD programs. In addition, UZH's continuing education programs offer excellent learning opportunities.",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "Switzerland",
        "University": "University of Zurich - Faculty of Law",
        "Description": "The University of Zurich (UZH) with its 26,000 enrolled students is Switzerland's largest university. Founded in the year 1833, UZH was Europe's first university to be established by a democratic political system; today, UZH is one of the foremost universities in the German-speaking world. Made up of seven faculties covering some 100 different subject areas, the University offers a wide variety of Bachelor's, Master's and PhD programs. In addition, UZH's continuing education programs offer excellent learning opportunities.",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "The Netherlands",
        "University": "University of Amsterdam",
        "Description": "The University of Amsterdam (UvA) has a strong international orientation. This is reflected in the curricula of the various degree programmes, the University’s research activities and its organisational culture. The globalisation of the labour market is creating growing demand for highly trained staff with international and intercultural competences, and international academic or work experienc The UvA’s international character is also reflected in its organisational culture. The UvA offers various services designed to help students, researchers and lecturers from other countries feel at home in Amsterdam and the Netherlands. The University also uses bilingual communications to help ensure that they feel or continue to feel part of the UvA community. Like its students, UvA lecturers are also expected to have explored the wider world and obtained international competences. The UvA stimulates them to teach for a semester at an international university, take part in international conferences or teach or attend a summer school abroad. ",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "The Netherlands",
        "University": "VU University Amsterdam",
        "Description": "The University of Amsterdam (UvA) has a strong international orientation. This is reflected in the curricula of the various degree programmes, the University’s research activities and its organisational culture. The globalisation of the labour market is creating growing demand for highly trained staff with international and intercultural competences, and international academic or work experienc The UvA’s international character is also reflected in its organisational culture. The UvA offers various services designed to help students, researchers and lecturers from other countries feel at home in Amsterdam and the Netherlands. The University also uses bilingual communications to help ensure that they feel or continue to feel part of the UvA community. Like its students, UvA lecturers are also expected to have explored the wider world and obtained international competences. The UvA stimulates them to teach for a semester at an international university, take part in international conferences or teach or attend a summer school abroad. ",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "The Netherlands",
        "University": "University of Groningen",
        "Description": "The University of Groningen has a rich academic tradition dating back to 1614. Out of this tradition rose a Nobel prize-winner, the first woman student and the first woman lecturer in the Netherlands, the first Dutch astronaut and the first president of the European Central Bank. Geographically, the university is rooted in the North of the Netherlands, a region very close to its heart. Several members of the Dutch royal family have also studied in Groningen, including Prince Maurits and Prince Bernard, both of whom studied economics at the University of Groningen",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "The Netherlands",
        "University": "Leiden University",
        "Description": "Leiden University, founded in 1575, is the oldest university in the Netherlands and enjoys an outstanding international reputation. The University offers a broad range of 46 bachelor's programmes and 73 master's programmes, from its 7 faculties; Archaeology, Campus The Hague, Humanities, Medicine/LUMC, Law, Social and Behavioural Sciences, and Science. Leiden University has some 24,500 students (from 110 different countries) and 5,500 staff (including Leiden University Medical Center), with a key focus on strong international orientation, developing a research-intensive profile and ensuring teaching and research of the highest quality. ",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "The Netherlands",
        "University": "Maastricht University (Law)",
        "Description": "Established in 1975, Universiteit Maastricht is the youngest university in The Netherlands. The university’s innovative and progressive learning method is clearly in accordance with this youthful allure. In Maastricht you will work in small groups in which you are confronted with real-life problems derived from a particular field of study. Universiteit Maastricht enjoys a highly international stature; due to the large amount of foreign students at UM, one in five students has a non-Dutch nationality. The university’s international orientation is underlined by the fact that several programmes are fully taught in English. ",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "The Netherlands",
        "University": "Maastricht University (UCM)",
        "Description": "Established in 1975, Universiteit Maastricht is the youngest university in The Netherlands. The university’s innovative and progressive learning method is clearly in accordance with this youthful allure. In Maastricht you will work in small groups in which you are confronted with real-life problems derived from a particular field of study. Universiteit Maastricht enjoys a highly international stature; due to the large amount of foreign students at UM, one in five students has a non-Dutch nationality. The university’s international orientation is underlined by the fact that several programmes are fully taught in English. ",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "The Netherlands",
        "University": "Maastricht University School of Business and Economics",
        "Description": "Established in 1975, Universiteit Maastricht is the youngest university in The Netherlands. The university’s innovative and progressive learning method is clearly in accordance with this youthful allure. In Maastricht you will work in small groups in which you are confronted with real-life problems derived from a particular field of study. Universiteit Maastricht enjoys a highly international stature; due to the large amount of foreign students at UM, one in five students has a non-Dutch nationality. The university’s international orientation is underlined by the fact that several programmes are fully taught in English. ",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "The Netherlands",
        "University": "Erasmus University, School of History, Culture and Communication (ESHCC)",
        "Description": "The Erasmus School of Economics is a leading academic institution in the world. Our school has a long-standing tradition of high-quality education and research. The best of our graduates have made outstanding contributions to science, government and business. Our education programmes start with the basic principles and end at the forefront of current scientific developments, taught and supervised by active, motivated researchers. ",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "The Netherlands",
        "University": "Rotterdam School of Management, Erasmus University",
        "Description": "The Erasmus School of Economics is a leading academic institution in the world. Our school has a long-standing tradition of high-quality education and research. The best of our graduates have made outstanding contributions to science, government and business. Our education programmes start with the basic principles and end at the forefront of current scientific developments, taught and supervised by active, motivated researchers. ",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "The Netherlands",
        "University": "Erasmus University Rotterdam, Erasmus School of Economics.",
        "Description": "The Erasmus School of Economics is a leading academic institution in the world. Our school has a long-standing tradition of high-quality education and research. The best of our graduates have made outstanding contributions to science, government and business. Our education programmes start with the basic principles and end at the forefront of current scientific developments, taught and supervised by active, motivated researchers. ",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "The Netherlands",
        "University": "Tilburg University",
        "Description": "Tilburg University (Katholieke Universiteit Brabant) was funded in 1927 and was originally a School of Economics. It is now a fully accredited, government-financed university and has 11,000 students, 750 international students, from over 50 countries, 460 of which are degree seeking students, 170 full professors. Tilburg University is well known for its high standards in education and scientific research as well as its good support facilities. In nationwide yearly rankings, Tilburg University has taken a top-position for many years now. Its campus, designed with a compact architectural concept in mind, is set in gently undulating, park-like grounds on a forest edge.",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "The Netherlands",
        "University": "Tilburg University (School of Law)",
        "Description": "Tilburg University (Katholieke Universiteit Brabant) was funded in 1927 and was originally a School of Economics. It is now a fully accredited, government-financed university and has 11,000 students, 750 international students, from over 50 countries, 460 of which are degree seeking students, 170 full professors. Tilburg University is well known for its high standards in education and scientific research as well as its good support facilities. In nationwide yearly rankings, Tilburg University has taken a top-position for many years now. Its campus, designed with a compact architectural concept in mind, is set in gently undulating, park-like grounds on a forest edge.",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "UK",
        "University": "University of Bath",
        "Description": "The University of Bath was founded by Royal Charter in 1966, and is a public institution, recognized by the British Government for the award of degrees. British Government Statutory Instrument 1997 No.1, the Education (Recognized Bodies) Order 1997 includes the University of Bath in its list of accredited Higher Education Institutions. The University of Bath awarded its own degrees at undergraduate and postgraduate level. The University of Bath is a member of the Association of Commonwealth Universities, of the Universities UK of the United Kingdom and of the Association of European Universities. ",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "UK",
        "University": "University of Bath Department of Economics",
        "Description": "The University of Bath was founded by Royal Charter in 1966, and is a public institution, recognized by the British Government for the award of degrees. British Government Statutory Instrument 1997 No.1, the Education (Recognized Bodies) Order 1997 includes the University of Bath in its list of accredited Higher Education Institutions. The University of Bath awarded its own degrees at undergraduate and postgraduate level. The University of Bath is a member of the Association of Commonwealth Universities, of the Universities UK of the United Kingdom and of the Association of European Universities. ",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "UK",
        "University": "University of Warwick",
        "Description": "University of Warwick is one of the UK's leading universities, with an acknowledged reputation for excellence in research and teaching, for innovation, and for links with business and industry. Warwick has always taken the view that good research informs and strengthens the quality of education that it is able to offer its students. The original conception for the academic structure of the University was not to impose overall academic prescription but to make early appointments to the first professorships, selecting candidates with fresh and constructive ideas on how studies in their areas should be organised and developed.",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "UK",
        "University": "University of Edinburgh",
        "Description": "The University of Edinburgh is an ancient university founded in 1583. Located in the heart of Edinburgh, it part of Scotland's vibrant capital city. Recently ranked 6th in the UK, it is consistently ranked as one of the top 50 Universities in the world. The university has 33,000 students, with almost a third of them being international students from over 140 countries. Famous alumnis of Edinbugh include, Charles Darwin (Naturalist), David Hume (Philosopher), Piers Sellers (NASA Astronaut), and writers Robert Louis Stevenson, Ian Rankin and J K Rowling. ",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "UK",
        "University": "University of Exeter",
        "Description": "Exeter is a top 10 UK university which combines world leading research with very high levels of student satisfaction. It is one of the UK’s most popular and successful universities with campuses in Exeter, Devon, and near Falmouth in Cornwall. The University also has a permanent office in Dubai. Students and staff enjoy some of the finest campus environments in the UK. The South West counties of Devon and Cornwall boast an unrivalled mix of city life, countryside and coastline. ",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "UK",
        "University": "University of Glasgow",
        "Description": "Founded in 1451, the University of Glasgow is the fourth oldest university in the English-speaking world. We are one of the top 100 of the world's universities and have been named Scottish University of the Year by The Times and The Sunday Times Good University Guide 2018. ",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "UK",
        "University": "University of Surrey",
        "Description": "The University is taking a leading role in innovation and wealth creation in the South East of England. Successful partnership with industry has allowed the University as a whole to depend less upon Government grant sources than any other similar university in the UK. With a turnover of over £100 million, two-thirds of income is now earned through its own enterprise in association with industrial partners.",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "UK",
        "University": "Leeds University",
        "Description": "In the last national research review, 23 of our departments were rated nationally as being in the top ten in that subject area. This reinforced Leeds’ place in the UK's top ten universities for research. The University is also acclaimed worldwide for the quality of its teaching at undergraduate and postgraduate level. Leeds staff has won prestigious national awards for quality and innovation in teaching. Strong academic areas include the Arts, Business, Biological Sciences, Engineering, Earth and the Environment, Health including Medicine and Dentistry, Mathematics and Physical Sciences, Performing Arts and the Social Sciences. The University's International Foundation Year has seen students from over 65 countries successfully progress on to 106 different undergraduate degree programmes. ",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "UK",
        "University": "Leeds University - School of Law",
        "Description": "In the last national research review, 23 of our departments were rated nationally as being in the top ten in that subject area. This reinforced Leeds’ place in the UK's top ten universities for research. The University is also acclaimed worldwide for the quality of its teaching at undergraduate and postgraduate level. Leeds staff has won prestigious national awards for quality and innovation in teaching. Strong academic areas include the Arts, Business, Biological Sciences, Engineering, Earth and the Environment, Health including Medicine and Dentistry, Mathematics and Physical Sciences, Performing Arts and the Social Sciences. The University's International Foundation Year has seen students from over 65 countries successfully progress on to 106 different undergraduate degree programmes. ",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "UK",
        "University": "University of Leicester - School of Law",
        "Description": "The University of Leicester is a leading UK University committed to international excellence through the creation of world changing research and high quality, inspirational teaching. Leicester is the most socially inclusive of Britain's top-20 leading universities. ",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "UK",
        "University": "City University London",
        "Description": "City University was founded in 1894 as the Northampton Institute and awarded full university status in 1966. It is based in the heart of London, close to the City of London, where it contributes significantly to the capital’s academic, cultural and business life. It has almost 11,500 students from 153 countries who benefit from the University’s internationally renowned experience of more than one hundred years’ of teaching and learning. City’s graduate employment record continues to be one of the best in the country. Dynamic research activity across all schools and institutes, including substantial interdisciplinary work, underpins City’s distinctive position as the University for business & the professions.",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "UK",
        "University": "King's College London ",
        "Description": "At the heart of our vision for internationalisation are two core values: cultural competency & having a global problem solving mindset. We define cultural competency as the ability to see the world through the lens of others – in all their diversity. This includes people from different nations and regions, socio-economic backgrounds, races, genders, ages, religions and abilities. Students and staff at King’s develop their cultural competency at home, abroad and online. Our own diversity, curriculum, interdisciplinarity, London location, dedication in service to society and global reach all combine to make this possible. We are committed to developing successful students, staff and alumni who can contribute to building a better, fairer world around them. The best minds with a clear sense of mission and world changing ideas come to King’s and are helped to develop and implement these ideas. We are an international community that serves the world.",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "UK",
        "University": "Queen Mary University of London",
        "Description": "At Queen Mary University of London, we believe that a diversity of ideas helps us achieve the previously unthinkable. Throughout our history, we’ve fostered social justice and improved lives through academic excellence. And we continue to live and breathe this spirit today, not because it’s simply ‘the right thing to do’ but for what it helps us achieve and the intellectual brilliance it delivers. Our reformer heritage informs our conviction that great ideas can and should come from anywhere. It’s an approach that has brought results across the globe, from the communities of east London to the favelas of Rio de Janeiro. We continue to embrace diversity of thought and opinion in everything we do, in the belief that when views collide, disciplines interact, and perspectives intersect, truly original thought takes form. ",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "UK",
        "University": "University College London, School of Management",
        "Description": "University College London (UCL) was founded in 1826 to bring higher education to those who were typically excluded from it. In 1878, it became the first university in England to admit women on equal terms as men. Located in the heart of London, UCL is a constituent college of the University of London and a member of the Russell Group, with approximately 850 professors and over 6,000 academic and research staff. UCL comprises 11 faculties: Arts and Humanities, Built Environment, Brain Sciences, Engineering, the Institute of Education, Laws, Life Sciences, Mathematical and Physical Sciences, Medical Sciences, Population Health Sciences, and Social and Historical Sciences.",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "UK",
        "University": "University of London (The School of Oriental and African Studies)",
        "Description": "SOAS University of London is the only Higher Education institution in Europe specialising in the study of Asia, Africa and the Near and Middle East. SOAS is a remarkable institution. Uniquely combining language scholarship, disciplinary expertise and regional focus, it has the largest concentration in Europe of academic staff concerned with Africa, Asia and the Middle East. On the one hand, this means that SOAS scholars grapple with pressing issues - democracy, development, human rights, identity, legal systems, poverty, religion, social change - confronting two-thirds of humankind while at the same time remaining guardians of specialised knowledge in languages and periods and regions not available anywhere else in the UK. SOAS is synonymous with intellectual enquiry and achievement. As a global academic base and a crucial resource for London, SOAS is distinctively positioned to analyse, understand and explain some of the most challenging issues facing us in the world today. Our academic focus on the languages, cultures and societies of Africa, Asia and the Middle East makes us an indispensable interpreter in a complex world. ",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "UK",
        "University": "University of Manchester",
        "Description": "The University of Manchester has been created by bringing together The Victoria University of Manchester and UMIST, two of Britain's most distinguished universities, to create a powerful new force in British Higher Education. Manchester has a long tradition of excellence in Higher Education. UMIST can trace its roots back to 1824 and the formation of the Manchester Mechanics' Institute, whilst The Victoria University of Manchester was founded as Owens College in 1851. After 100 years of working together, these two great institutions are formally combining to form a single university, coming into being on 22 October 2004.",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "UK",
        "University": "University of Manchester (Faculty of Law)",
        "Description": "The University of Manchester has been created by bringing together The Victoria University of Manchester and UMIST, two of Britain's most distinguished universities, to create a powerful new force in British Higher Education. Manchester has a long tradition of excellence in Higher Education. UMIST can trace its roots back to 1824 and the formation of the Manchester Mechanics' Institute, whilst The Victoria University of Manchester was founded as Owens College in 1851. After 100 years of working together, these two great institutions are formally combining to form a single university, coming into being on 22 October 2004.",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "UK",
        "University": "University of Southampton",
        "Description": "The University began as the Hartley Institute, which was founded in 1862. The University of Southampton was granted its Royal Charter in 1952, and has continued to grow and flourish ever since. Approximately 100 km from London Heathrow Airport ",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "UK",
        "University": "University of Southampton (Faculty of Law)",
        "Description": "The University began as the Hartley Institute, which was founded in 1862. The University of Southampton was granted its Royal Charter in 1952, and has continued to grow and flourish ever since. Approximately 100 km from London Heathrow Airport ",
        "Users": []
    },
    {
        "Continent": "Europe",
        "Country": "UK",
        "University": "University of York (Law School)",
        "Description": "York Law School is an inspirational place for study and research. It is a top rated school for research, teaching and learning with a vibrant community committed to excellence. Their new, purpose-built school provides exceptional facilities and a dynamic environment for learning and research. They pride themselves on their innovative teaching and forward thinking approach that keeps them at the forefront of legal education. Their students are taught by some of the UK’s top legal scholars engaged in specialist research. They offer a program which is modern and relevant to the legal profession as well as the many other professions their students go on to join. ",
        "Users": []
    },
    {
        "Continent": "Asia",
        "Country": "Hong Kong",
        "University": "University of Hong Kong",
        "Description": "Evolved from the former Hong Kong College of Medicine which was instituted in 1887. In 1911, The University of Hong Kong was formally founded. From its modest beginnings of only two departments, the University has grown to embrace almost all major areas of teaching and research. It is one of the top Asia universities in the region. Today, the University of Hong Kong has a student population of over 15,000, including 9,415 undergraduates, 5,081 postgraduates and 1,024 international students. The University has an academic staff population of around 900.",
        "Users":[["Prashanthini Linggam","F","Year 4", "SOE"], ["Li Cheng Boon","M","Year 4", "SCIS"],["Sim Sing Yu","F","Year 4", "SOE"], ["Pan Kai Wen","F","Year 4", "SOA"],["Ong Shu Hui","F","Year 4", "SOE"], ["Chang Jun De","M","Year 4", "SOE"]]
    },
    {
        "Continent": "Asia",
        "Country": "Hong Kong",
        "University": "City University of Hong Kong",
        "Description": "One of the eight tertiary institutions funded by Hong Kong Special Administrative Region government through the University Grants Committee. The Faculty of Business at City University of Hong Kong offers undergraduate and postgraduate programmes tailormade to suit the specific needs of different professions, as well as research degrees leading to the awards of MPhil and PhD. The Faculty comprises 6 departments namely Accountancy, Economics and Finance, Information systems, Management, Management Sciences and marketing and is one of the largest business schools in Hong Kong. It has some 200 academic staff and eminent scholars recruited from around the world. This diversity ensures our participants have a global vision of the business environment.",
        "Users":[["Hong Ming En","M","Year 4", "SOB"], ["Lew Xi Ling","F","Year 4", "SCIS"]]
    },
    {
        "Continent": "Asia",
        "Country": "Hong Kong",
        "University": "Hong Kong University of Science and Technology",
        "Description": "The story of the Hong Kong University of Science and Technology begins with the late Sir Edward Youde, Governor of Hong Kong from 1982 to 1986, Sir S.Y. Chung, and others who foresaw the need in the territory for an educational institution to lead the way in the areas of science and technology vital to the region’s economic future. HKUST Business School comprises six departments: Accounting, Economics, Finance, Information & Systems Management, Management of Organizations, and Marketing. There have been eight congregations since the establishment of the business school in 1991. The University campus occupies a 60-hectares (150 acre) site of sweeping natural beauty on the Clear Water Bay peninsula in East Kowloon, less than 30 minutes, driving time from central Hong Kong.",
        "Users":[["Siu Ziak Loo","M","Year 4", "SOA"], ["Ho Lin Min","F","Year 4", "SOB"]]
    },
    {
        "Continent": "Asia",
        "Country": "Hong Kong",
        "University": "Hong Kong Baptist University",
        "Description": "In 1956, Hong Kong Baptist College was founded by the Baptist Convention of Hong Kong as a post-secondary college committed to the provision of whole person education. In 1983, Hong Kong Baptist College became a fullyfunded public tertiary institution. It gained university status in 1994 and was renamed Hong Kong Baptist University (HKBU). Today HKBU encompasses eight Faculties/Schools offering a range of undergraduate programmes, associate degree and higher diploma programmes as well as taught postgraduate programmes and research postgraduate programmes leading to the award of master and doctoral degrees."
    },
    {
        "Continent": "Asia",
        "Country": "Hong Kong",
        "University": "Chinese University of Hong Kong",
        "Description": "The Chinese University of Hong Kong (CUHK) is a leading comprehensive research university. It has a total of 61 departments under the Faculties of Arts, Business Administration, Education, Engineering, Medicine, Science, Social Science and Law. Currently, it has approximately 21,000 students undertaking undergraduate, postgraduate and doctoral programmes."
    },
    {
        "Continent": "Asia",
        "Country": "China",
        "University": "China University of Political Science and Law",
        "Description": "China University of Political Science and Law is a national public research university specialized in law, arts, history, philosophy, economics, management and foreign languages established in 1952 in Beijing, China. China University of Political Science and Law is a first tier institution within the national key university Project 211 and the Project 985 Innovative Platforms for Key Disciplines as part of the national endeavor to build world-class universities. CUPL is widely considered to be one of the best Chinese universities in legal studies. It is also one of the most competitive and selective universities to enter in China. "
    },
    {
        "Continent": "Asia",
        "Country": "China",
        "University": "Fudan University, School of Economics",
        "Description": "Fudan consists of seventeen schools, and four independent departments (Physics, Chemistry, Macromolecular Science, and Environmental Science and Engineering). T he University confers bachelor's degrees in 68 academic disciplines, master's degrees in 209 disciplines and doctoral degrees in 175 academic disciplines. Years of learning and discovering have yielded great benefits as well as profits. In return, the multi-pattern development of the high-tech industries helps the University with breathtaking efficiency to industrialize the research outcomes. Meanwhile, a group of University-sponsored enterprises is emerging, filled with passion and ambition. Fudan has thus created its signature style of doing business."
    },
    {
        "Continent": "Asia",
        "Country": "China",
        "University": "Fudan University, School of Management",
        "Description": "Fudan consists of seventeen schools, and four independent departments (Physics, Chemistry, Macromolecular Science, and Environmental Science and Engineering). T he University confers bachelor's degrees in 68 academic disciplines, master's degrees in 209 disciplines and doctoral degrees in 175 academic disciplines. Years of learning and discovering have yielded great benefits as well as profits. In return, the multi-pattern development of the high-tech industries helps the University with breathtaking efficiency to industrialize the research outcomes. Meanwhile, a group of University-sponsored enterprises is emerging, filled with passion and ambition. Fudan has thus created its signature style of doing business."
    },
    {
        "Continent": "Asia",
        "Country": "China",
        "University": "Fudan University, School of Social Development and Public Policy",
        "Description": "Fudan consists of seventeen schools, and four independent departments (Physics, Chemistry, Macromolecular Science, and Environmental Science and Engineering). T he University confers bachelor's degrees in 68 academic disciplines, master's degrees in 209 disciplines and doctoral degrees in 175 academic disciplines. Years of learning and discovering have yielded great benefits as well as profits. In return, the multi-pattern development of the high-tech industries helps the University with breathtaking efficiency to industrialize the research outcomes. Meanwhile, a group of University-sponsored enterprises is emerging, filled with passion and ambition. Fudan has thus created its signature style of doing business."
    },
    {
        "Continent": "Asia",
        "Country": "China",
        "University": "Fudan University, School of Software",
        "Description": "Fudan consists of seventeen schools, and four independent departments (Physics, Chemistry, Macromolecular Science, and Environmental Science and Engineering). T he University confers bachelor's degrees in 68 academic disciplines, master's degrees in 209 disciplines and doctoral degrees in 175 academic disciplines. Years of learning and discovering have yielded great benefits as well as profits. In return, the multi-pattern development of the high-tech industries helps the University with breathtaking efficiency to industrialize the research outcomes. Meanwhile, a group of University-sponsored enterprises is emerging, filled with passion and ambition. Fudan has thus created its signature style of doing business."
    },
    {
        "Continent": "Asia",
        "Country": "China",
        "University": "Jilin University",
        "Description": "Students of Mainland China, Hong Kong, Macau and Taiwan nationality CANNOT apply to this university for ISEP. Jilin University (JLU) is a leading national university under the direct jurisdiction of China's Ministry of Education. Located in Changchun, the capital city of Jilin Province in Northeastern China, the University has eight campuses in five districts which are home to thirty-nine colleges covering eleven academic disciplines, including philosophy, economics, law, literature, education, history, science, engineering, agriculture, medicine, and management. The University boasts sixteen disciplinary areas, five national key laboratories, and eight national bases for the development of basic science. Other resources include five research bases for humanities and social sciences, seven key laboratories sponsored by the Ministry of Education and eleven by other ministries of Chinese government."
    },
    {
        "Continent": "Asia",
        "Country": "China",
        "University": "Nanjing University",
        "Description": "Founded in 1902, Nanjing University (NJU) is a century-old university and enjoys high reputation both in China and abroad. It is part of the prestigious C9 League of Universities in China. Presently, NJU has over 33,205 full time students, among whom are 14,188 undergraduate students, 15,667 master and doctoral students and 3,350 international students. It is a comprehensive university and offers courses ranging from humanities, business and engineering related disciplines. In terms of ranking, according to the Essential Science Indicators, 16 academic disciplines at NJU are ranked in the top 1% worldwide. NJU has three campuses: Xianlin Campus, Gulou Campus and Pukou Campus."
    },
    {
        "Continent": "Asia",
        "Country": "China",
        "University": "Nankai University",
        "Description": "Students of Mainland China, Hong Kong, Macau and Taiwan nationality CANNOT apply to this university for ISEP. Founded in 1919 by famous educationist Zhang Bo Ling and Yan Xiu in Tianjing city, Nankai University is not only one of top universities in China, but also a famous tertiary educational institute in the world. The university plays an active role in the international education exchange and research. The first Prime Minister of China Zhou En Lai graduated from Nankai University. The campus has a total area of 1.46 million square metres and it is only 137 km from Beijing. The university has 18 schools and currently, it has 28023 students."
    },
    {
        "Continent": "Asia",
        "Country": "China",
        "University": "Peking University (Guanghua School of Management)",
        "Description": "Founded in 1898, Peking University was originally known as the Imperial University of Peking. It was the first national university covering comprehensive disciplines in China, and has been a leading institution of higher education in China since its establishment. In 1912, the university adopted its present name. At the end of the 20th century, the Chinese government put Peking University at the top of its agenda for promoting higher education, with the aim to build a world-class university in the 21st Century. Peking University has continually played the essential role of pioneers in the course of China's modernization. The university's traditional emphasis on patriotism, progress, democracy, and science, together with its educational standards of diligence, precision, factualism, and innovation, have been passed down from generation to generation."
    },
    {
        "Continent": "Asia",
        "Country": "China",
        "University": "Peking University (Law School)",
        "Description": "Founded in 1898, Peking University was originally known as the Imperial University of Peking. It was the first national university covering comprehensive disciplines in China, and has been a leading institution of higher education in China since its establishment. In 1912, the university adopted its present name. At the end of the 20th century, the Chinese government put Peking University at the top of its agenda for promoting higher education, with the aim to build a world-class university in the 21st Century. Peking University has continually played the essential role of pioneers in the course of China's modernization. The university's traditional emphasis on patriotism, progress, democracy, and science, together with its educational standards of diligence, precision, factualism, and innovation, have been passed down from generation to generation."
    },
    {
        "Continent": "Asia",
        "Country": "China",
        "University": "Peking University (School of International Studies)",
        "Description": "Founded in 1898, Peking University was originally known as the Imperial University of Peking. It was the first national university covering comprehensive disciplines in China, and has been a leading institution of higher education in China since its establishment. In 1912, the university adopted its present name. At the end of the 20th century, the Chinese government put Peking University at the top of its agenda for promoting higher education, with the aim to build a world-class university in the 21st Century. Peking University has continually played the essential role of pioneers in the course of China's modernization. The university's traditional emphasis on patriotism, progress, democracy, and science, together with its educational standards of diligence, precision, factualism, and innovation, have been passed down from generation to generation."
    },
    {
        "Continent": "Asia",
        "Country": "China",
        "University": "Renmin University (School of Business)",
        "Description": "Renmin University of China, or Renda, a public research university located in the Haidian District of Beijing, China. Founded by the Communist Party of China, RUC possesses academic strengths in humanities and social sciences, and is regarded highly among Chinese universities."
    },
    {
        "Continent": "Asia",
        "Country": "China",
        "University": "Renmin University of China",
        "Description": "Renmin University of China, or Renda, a public research university located in the Haidian District of Beijing, China. Founded by the Communist Party of China, RUC possesses academic strengths in humanities and social sciences, and is regarded highly among Chinese universities."
    },
    {
        "Continent": "Asia",
        "Country": "China",
        "University": "Renmin University of China (School of Law)",
        "Description": "Renmin University of China, or Renda, a public research university located in the Haidian District of Beijing, China. Founded by the Communist Party of China, RUC possesses academic strengths in humanities and social sciences, and is regarded highly among Chinese universities."
    },
    {
        "Continent": "Asia",
        "Country": "China",
        "University": "Shanghai Jiao Tong University",
        "Description": "Founded in 1918, The School of Management, Shanghai Jiao Tong University, previously known as Railway Management Department is one of the earliest business schools in China. It originated from Nan Yang Business Institute which was founded by Mr. SHENG Xuanhuai with the permission of the government of Qing Dynasty in 1903. In 1996, Aetna International Inc. entered into cooperation with SJTU to develop the school of management. In 2000, the School of Management was officially named as Antai School of Management. In 2006, ASOM Officially renamed as Antai College of Economics and Management. Antai College of Economics and Management is located in Fa Hua campus, which is 15 minutes’ walk from the main campus."
    },
    {
        "Continent": "Asia",
        "Country": "China",
        "University": "Shanghai Jiaotong University (KoGuan Law School)",
        "Description": "Founded in 1918, The School of Management, Shanghai Jiao Tong University, previously known as Railway Management Department is one of the earliest business schools in China. It originated from Nan Yang Business Institute which was founded by Mr. SHENG Xuanhuai with the permission of the government of Qing Dynasty in 1903. In 1996, Aetna International Inc. entered into cooperation with SJTU to develop the school of management. In 2000, the School of Management was officially named as Antai School of Management. In 2006, ASOM Officially renamed as Antai College of Economics and Management. Antai College of Economics and Management is located in Fa Hua campus, which is 15 minutes’ walk from the main campus."
    },
    {
        "Continent": "Asia",
        "Country": "China",
        "University": "Shanghai University of Finance & Economics",
        "Description": "Founded in 1918, The School of Management, Shanghai Jiao Tong University, previously known as Railway Management Department is one of the earliest business schools in China. It originated from Nan Yang Business Institute which was founded by Mr. SHENG Xuanhuai with the permission of the government of Qing Dynasty in 1903. In 1996, Aetna International Inc. entered into cooperation with SJTU to develop the school of management. In 2000, the School of Management was officially named as Antai School of Management. In 2006, ASOM Officially renamed as Antai College of Economics and Management. Antai College of Economics and Management is located in Fa Hua campus, which is 15 minutes’ walk from the main campus."
    },
    {
        "Continent": "Asia",
        "Country": "China",
        "University": "Southwestern University of Finance and Economics (Research Institute of Economics and Management)",
        "Description": "Southwestern University of Finance and Economics (SWUFE) is a specialised finance, economics and business university located in Chengdu, China. SWUFE is one of the three specialised universities in finance and economics in China. As a training base for the development of the financial industry as well as the socio-economic development of western China, SWUFE is known as China’s financial talent pool. SMU students will have the opportunity to study at the Research Institute of Economics and Management (RIEM). RIEM was established in 2006 in dedication to high quality teaching and research in economics, finance and management."
    },
    {
        "Continent": "Asia",
        "Country": "China",
        "University": "Sun Yat Sen University, Business School",
        "Description": "Sun Yat-Sen University, previously named Guangdong University, was founded by Mr Sun Yat-Sen in 1924. He combined the National Normal University, Guangdong Law University and Guangdong Agricultural University to form Guangdong University. In 1926, Guangdong University was changed to Sun Yat-Sen University in memory of Mr Sun Yat-Sen. Located on the bank of the Zhujiang River and the cost of Southern Sea in the capital city of Guangdong Province - Guangzhou, Sun Yat-Sen University has a total area of 5.04 sq km. It is one of the key universities in China. Since its establishment, it has grown from the initial 7 schools into 19 schools in three campuses. It has a total student population of 40,400, among whom, 1970 PhDs, 5440 masters, 1250 post graduates and 17,100 undergraduates and 450 foreign students. It also has more major affiliated hospitals. It has been active in the academic exchange with foreign universities and academic institutions."
    },
    {
        "Continent": "Asia",
        "Country": "China",
        "University": "Sun Yat Sen University, School of Government",
        "Description": "Sun Yat-Sen University, previously named Guangdong University, was founded by Mr Sun Yat-Sen in 1924. He combined the National Normal University, Guangdong Law University and Guangdong Agricultural University to form Guangdong University. In 1926, Guangdong University was changed to Sun Yat-Sen University in memory of Mr Sun Yat-Sen. Located on the bank of the Zhujiang River and the cost of Southern Sea in the capital city of Guangdong Province - Guangzhou, Sun Yat-Sen University has a total area of 5.04 sq km. It is one of the key universities in China. Since its establishment, it has grown from the initial 7 schools into 19 schools in three campuses. It has a total student population of 40,400, among whom, 1970 PhDs, 5440 masters, 1250 post graduates and 17,100 undergraduates and 450 foreign students. It also has more major affiliated hospitals. It has been active in the academic exchange with foreign universities and academic institutions."
    },
    {
        "Continent": "Asia",
        "Country": "China",
        "University": "Tsinghua University, School of Economics and Management",
        "Description":"Tsinghua University was established in 1911, originally under the name “Tsinghua Xuetang”. The school was renamed \"Tsinghua School\" in 1912. The university section was founded in 1925. The name “National Tsinghua University” was adopted in 1928. The faculty greatly valued the interaction between Chinese and Western cultures, the sciences and humanities, the ancient and modern. Tsinghua scholars Wang Guowei, Liang Qichao, Chen Yinque and Zhao Yuanren, renowned as the \"Four Tutors\" in the Institute of Chinese Classics, advocated this belief and had a profound impact on Tsinghua's later development. Since China opened up to the world in 1978, Tsinghua University has developed at a breathtaking pace into a comprehensive research university. At present, the university has 14 schools and 56 departments with faculties in science, engineering, humanities, law, medicine, history, philosophy, economics, management, education and art. The University has now over 25,900 students, including 13,100 undergraduates and 12,800 graduate students. As one of China’s most renowned universities, Tsinghua has become an important institution for fostering talent and scientific research."
    },
    {
        "Continent": "Asia",
        "Country": "China",
        "University": "Tsinghua University, School of Law",
        "Description": ""
    },
    {
        "Continent": "Asia",
        "Country": "China",
        "University": "Tsinghua University, School of Social Sciences",
        "Description": ""
    },
    {
        "Continent": "Asia",
        "Country": "China",
        "University": "Wuhan University",
        "Description": "Students of Mainland China, Hong Kong, Macau and Taiwan nationality CANNOT apply to this university for ISEP. Wuhan University is located in the capital of Hubei province Wuhan City which is known as 'the thoroughfare leading to nice provinces'. The university dates back to Ziqiang Institute founded in 1893 by the Hubei and Hunan Governor Zhang Zhidong. Later, it changed its name several times before it was named national Wuhan University in July 1928. Approved by the State Council, Wuhan in August 2000, an amalgamation of the original Wuhan University, Wuhan Water Conservancy and Power University, Wuhan Survey-and-Cartography Science-and-Technology University and Hubei Medical University. The new Wuhan University (named Wuhan University hereinafter) has a vast range of prospects of development because it is a combination of 4 first-rate. It is a comprehensive university with 85 undergraduate degree programs. There are more than 5,000 faculty staff and 40,000 students (including 8,000 postgraduates)"
    },
    {
        "Continent": "Asia",
        "Country": "China",
        "University": "Xi’an Jiaotong University",
        "Description": "Students of Mainland China, Hong Kong, Macau and Taiwan nationality CANNOT apply to this university for ISEP. Xi'an Jiaotong University (XJTU) is a key university under the direct administration of the Ministry of Education of China and is one of the oldest universities in China. XJTU is a comprehensive research university with 10 major categories of disciplines: science, engineering, medicine, economics, management, humanities, law, philosophy, education and art, and 27 schools, 9 university colleges for undergraduates and 19 affiliated teaching hospitals."
    },
    {
        "Continent": "Asia",
        "Country": "China",
        "University": "Xiamen University",
        "Description": "Students of Mainland China, Hong Kong, Macau and Taiwan nationality CANNOT apply to this university for ISEP. Located in the costal Xiamen City in Fujian Province, Xiamen University was founded in 1921 by Tan Kah Kee, the well-known patriotic overseas Chinese leader. It is the only key comprehensive university directly affiliated with the Education ministry in any of the five special economic zones, and it is one of China’s higher-level universities designated for the cross-century key construction. Xiamen University has 17 colleges that contain 34 departments and 61 sections for undergraduates. It is a comprehensive university providing a fairly complete range of programs of education in humanities, social science, natural science, engineering and technology, management, art education, and medical science. It has a teaching and administrative staff of over 4,100 members. The university has nearly 20,000 students on campus, including 14,000 undergraduates, over 4,600 masters’ students, nearly 1000 doctoral students, over 500 international students."
    },
    {
        "Continent": "Asia",
        "Country": "China",
        "University": "Zhejiang University",
        "Description": "Students of Mainland China, Hong Kong, Macau and Taiwan nationality CANNOT apply to this university for ISEP. Zhejiang University (ZJU) was founded in 1897 as one of the oldest institutions of higher learning in China. Reputed as 'the East Cambridge' in history, it has always been ranked among the few top universities in China, in terms of its comprehensive academic strength showed in teaching research and social service. ZJU has 44,151 full-time students, including 24,983 undergraduates, 11,883 graduate students working for master degree, 6,050 doctoral candidates, 1,235 foreign students. With six campuses namely, Yuquan, Xixi, Huajiachi, Hubin, Zhejiang and Zijigang, Zhejiang University has a total area of 533 hectares and a floor space of 2,010,000 square meters."
    },
    {
        "Continent": "Asia",
        "Country": "India",
        "University": "NALSAR University of Law",
        "Description": ""
    },
    {
        "Continent": "Asia",
        "Country": "India",
        "University": "National Law School of India University",
        "Description": "The National Law School of India University (NLS) is an institution for under-graduate and graduate legal education. Based in Nagarbhavi, a quiet suburb in the western extremities of the city of Bangalore, the NLS was established in 1987 after a statute was enacted for that purpose by the Legislative Assembly of the State of Karnataka. Historically legal education in India was open only to graduates and seen merely as professional training. Dismayed at the quality of legal education in conventional universities, several members of the legal fraternity debated a new system of legal education through the 1970s and 1980s. NLS has been rated as the best law school in India for 9 out of past 10 years by India today. It admits 80 students for its 5-year B.A., LL.B. (Hons.) In addition to the five-year B.A., LL.B. (Hons.) under-graduate course, it also offers a post-graduate degree (LL.M.) in business laws and human rights, and distance learning programmes, including Masters Degree in Business Law and Postgraduate Diploma programs in Human Rights Law, Medical Law, Environmental Law and IP Law."
    },
    {
        "Continent": "Asia",
        "Country": "Indonesia",
        "University": "Universitas Gadjah Mada",
        "Description": ""
    },
    {
        "Continent": "Asia",
        "Country": "Japan",
        "University": "Chuo University",
        "Description": "Chuo University was founded as Igirisu Horitsu Gakko (the English Law School) in 1885 and has since carried on a strong tradition of providing practical education based on British empiricism and rationalism, as well as maintaining the founding spirit of nurturing human resources in a dynamic and supportive atmosphere. Chuo University is a private university in Tokyo, renowned for its law school. The University has four campuses, six faculties, ten graduate schools, and nine research institutes. It also operates four high schools and two junior high schools."
    },
    {
        "Continent": "Asia",
        "Country": "Japan",
        "University": "Doshisha University",
        "Description": ""
    },
    {
        "Continent": "Asia",
        "Country": "Japan",
        "University": "Graduate School of Economics and Faculty of Economics, Kyoto University",
        "Description": ""
    },
    {
        "Continent": "Asia",
        "Country": "Japan",
        "University": "Hitotsubashi University",
        "Description": "Hitotsubashi University is the only university in Japan to specialize exclusively in the humanities and social sciences. The academic organization of the university consists of four undergraduate faculties: Commerce and Management, Economics, Law, and Social Sciences. There are graduate schools in the same four fields, plus two additional programs: International Corporate Strategy and Language and Society. The University also has an Institute of Economic Research and an Institute of Innovation Research. Currently, Hitotsubashi has a teaching staff of about 670, with approximately 4,400 students enrolled in undergraduate courses and 2,000 in Graduate courses. There are some 580 international students, along with about 450 researchers from abroad whom Hitotsubashi welcome each year around the world."
    },
    {
        "Continent": "Asia",
        "Country": "Japan",
        "University": "Hokkaido University",
        "Description": "Hokkaido University is one of the oldest, largest, and most prestigious universities in Japan. Boasting the largest number of faculties of Japan’s national universities, it has remained in the top tier of universities in Japan. Hokkaido University offers a broad-based educational experience, world-class research facilities, and all the attractions of living in the cosmopolitan city of Sapporo."
    },
    {
        "Continent": "Asia",
        "Country": "Japan",
        "University": "Kansai Gaidai University",
        "Description": "Kansai Gaidai was originally established in 1945 as a small, private language school amid the smoldering ruins of post-war Japan. The founder, Noboru and Takako Tanimoto, truly dedicated educators who witnessed political chaos and economic depression, hoped to create an institution which would develop in its students a sense of internationalism. Today, the school prospers as a private, nonprofit institution with the four distinct educational programs, namely Kansai Gaidai University, Kansai Gaidai college, The Graduate School and the Asian Studies Programme. Located in the cultural heart of Japan, the campus provides a excellent starting from which to begin exploring of a land that is truly fascinating. Many of the cities in the Kansai region are extensively utilized in the Asian Studies programme through field trips, independent research, and/or case studies."
    },
    {
        "Continent": "Asia",
        "Country": "Japan",
        "University": "Keio University",
        "Description": "As Japan's oldest private university, Keio owes much of its continued success to a long and fruitful history of international exchange. From its inception to the present, Keio has promoted and maintained a tradition of exchange among students. The organization has also placed great value on the cross-pollination of educational ideas and joint research among academics. Moreover, believing global research and education to be of great importance, Keio endeavors to strengthen its network of alumni who are active abroad. Keio welcomes some 500 students from some 35 different countries, who come to gain overseas experience, conduct research, and learn Japanese. Keio has reciprocal arrangements with more than 60 overseas universities and university consortiums."
    },
    {
        "Continent": "Asia",
        "Country": "Japan",
        "University": "Keio University (Law School)",
        "Description": "Keio University Law School is located on the Mita campus of Keio University. It is housed in a building erected in 2005, and includes state of the art communications, research and teaching facilities. The faculty of the Law School consists of approximately 55 full-time professors and around 135 adjunct professors. The faculty is drawn from among the leading academics, judges, prosecutors, and private practitioners in Japan. Under the new bar examination system beginning from 2006, Keio Law School has consistently placed in the top tier of law schools nationwide measured by total number of passing students and bar passage rate. The Law School admits approximately 230 students to each entering class. Students are admitted to either a twoyear (kishu) or a three-year (mishu) program leading in both cases to a J.D. degree."
    },
    {
        "Continent": "Asia",
        "Country": "Japan",
        "University": "Kwansei Gakuin University",
        "Description": "Kwansei Gakuin was founded in 1889 by the American missionary Reverend Walter Russell Lambuth, M.D. with the aim of training missionaries and educating young people based on Christian principles. After working in China as a missionary doctor, Reverend Lambuth came to Japan to spread Christianity in the country. He was a missionary and educator in all continents except the Antarctica and Australia, even venturing as far as the Congo in Africa. Reverend Lambuth said, “Foster citizens of the world who are disciples of Christ,” and he lived these words by dedicating his life to being a global servant. Kwansei Gakuin University is an independent institution for higher education, offering Bachelor's, Master's, and Doctoral degrees in over 35 different disciplines to a student body of about 19,000, including approximately 300 foreign students. The University maintains academic standards that rank among the highest of all Japanese universities and colleges. It is one of the four leading private universities in the Kansai region of Japan."
    },
    {
        "Continent": "Asia",
        "Country": "Japan",
        "University": "Kyushu University",
        "Description": "The history of Kyushu University dates back to 1903 when Fukuoka medical College was established as the foundation of Kyushu Imperial University. The college was legally attached to Kyoto Imperial University at that time. In 1911, Kyushu Imperial University, along with the Colleges of medicine and Engineering, was established. Since then various reforms have been made to the higher education system in Japan, such as the introduction of a new educational format after World War II and the expansion of faculties and departments on a large scale. The total number of students currently amounts to about 16,500 while the faculty members number 2,273. International exchange programs are also greatly encouraged at Kyushu University. In this regard, the university accepts many overseas students each year. At present there are more than 900 students from about sixty countries studying at the university."
    },
    {
        "Continent": "Asia",
        "Country": "Japan",
        "University": "Meiji University",
        "Description": "Meiji University was founded in January 1881 as the Meiji Law School by a group of young lawyers barely in their 30's: Tatsuo Kishimoto, Kozo Miyagi, and Misao Yashiro. It was an era characterized by Japan's urgent need to independent as a modern nation. The three founded the Meiji Law School from their fervent hope to 'foster bright capable youths who will lead the modern civil society of Japan'. Today, Meiji University solidly ranks among the best universities in Japan, currently consisting of eight schools: the School of Law, School of Commerce, School of Political Science and Economics, School of Arts and Letters, School of Science and Technology, School of Agriculture, School of Business Administration and School of Information and Communication; the Graduate School. Meiji University has 3 campuses, the main one (Surugadai) consisting of 20,000 students."
    },
    {
        "Continent": "Asia",
        "Country": "Japan",
        "University": "Nagoya University",
        "Description": "Established in 1871, Nagoya University is a comprehensive university with a rich history, with 9 Undergraduate and 14 Graduate Schools currently accepting students. It is highly accomplished as a Research University. Nagoya University is also making great efforts towards international exchange, and over 10% of Nagoya University's 16,000 students are international students from overseas."
    },
    {
        "Continent": "Asia",
        "Country": "Japan",
        "University": "Osaka University",
        "Description": "Osaka University is a national university located in Osaka, Japan. It is the sixth oldest university in Japan as the Osaka Prefectural Medical College, and one of Japan's National Seven Universities. It is the 4th best ranked higher education institution in Japan (96th worldwide) in 2016 by the Academic Ranking of World Universities."
    },
    {
        "Continent": "Asia",
        "Country": "Japan",
        "University": "Rikkyo University",
        "Description": "The Rikkyo University, founded in 1874 by an American Episcopal-Church missionary priest, is one of oldest and nationally recognized research universities in Japan. It has 10 colleges (Liberal Arts, Economics, Science, Sociology, Law, Tourism, Community& Human Services, Psychology, Intercultural Communication and Business) offering both undergraduate and graduate programs, and enrolling about 19,000 undergraduate and 1,500 graduate students. It has two campuses: The Ikebukuro campus, located in the center of Tokyo, is the home to College of Business and six other colleges, while the Niiza campus, about 30 minutes westward by train in the neighboring Saitama prefecture, is home to the colleges of Tourism, Community & Human Services, and Psychology."
    },
    {
        "Continent": "Asia",
        "Country": "Japan",
        "University": "Rikkyo University, College of Law & Politics",
        "Description": "The Rikkyo University, founded in 1874 by an American Episcopal-Church missionary priest, is one of oldest and nationally recognized research universities in Japan. It has 10 colleges (Liberal Arts, Economics, Science, Sociology, Law, Tourism, Community& Human Services, Psychology, Intercultural Communication and Business) offering both undergraduate and graduate programs, and enrolling about 19,000 undergraduate and 1,500 graduate students. It has two campuses: The Ikebukuro campus, located in the center of Tokyo, is the home to College of Business and six other colleges, while the Niiza campus, about 30 minutes westward by train in the neighboring Saitama prefecture, is home to the colleges of Tourism, Community & Human Services, and Psychology."
    },
    {
        "Continent": "Asia",
        "Country": "Japan",
        "University": "Ritsumeikan Asia Pacific University",
        "Description": "The University was established by the Ritsumeikan Trust in cooperation with Oita Prefecture and Beppu City. The University is a new international institution that aims to foster international exchange in Asia Pacific region and to internationalize higher education. Ritsumeikan Asia Pacific University is also intended to add a new dimension to Asia Pacific studies and foster global citizens who will contribute to sustainable development and peaceful coexistence in the Asia Pacific region and other parts of the world."
    },
    {
        "Continent": "Asia",
        "Country": "Japan",
        "University": "Sophia University",
        "Description": "Sophia University (上智大学 Jōchi daigaku) is a private university in Japan, with its main campus located in Yotsuya, an area of Tokyo's Chiyoda Ward in Japan. Sophia is one of the Tokyo's top ranked private universities. Sophia University was officially established in 1913 as a special school by the Society of Jesus, and has since grown into a large and well-reputed university with over 10,000 undergraduate students and 1,000 graduate students across four campuses in the Tokyo area."
    },
    {
        "Continent": "Asia",
        "Country": "Japan",
        "University": "Waseda University",
        "Description": "Established more than a century ago by Shigenobu Okuma, scholar and government leader, Waseda University is a private, coeducational institution of higher learning. Founded as a college with three departments under the old system of Japanese higher education, it has grown to become a comprehensive university with two senior high schools and a College of Technology. Outlined below are benchmarks in the University's history: Waseda University is comprised of the Corporation and the academic institution, both headed by the President, who serves as the Chairman of the Executive Board, and leads the academic institution as shown below. The President is elected by the faculty, staff, and alumni, serves a four-year term, and may be reelected to serve a second consecutive term. About 2 hours distance from city/airport."
    },
    {
        "Continent": "Asia",
        "Country": "Philippines",
        "University": "Ateneo de Manila University",
        "Description": "The Ateneo de Manila University began in 1859 as the Ateneo Municipal de Manila, a primary school establishment in Intramuros by Spanish priests of the Society of Jesus. The educational tradition of the University embraces a much older history, however, one intimately associated with history, as a teaching order, of the Jesuits in the Philippines. Today, nearly 140 years after its beginning in Intramuros, the Ateneo de Manila University is among the leading universities in the Philippines."
    },
    {
        "Continent": "Asia",
        "Country": "Philippines",
        "University": "De La Salle University",
        "Description": "De La Salle University – Manila is an internationally recognized Catholic university established by the Brothers of the Christian Schools in 1911. Inspired by the charism of St. John Baptist de La Salle, the University harmonizes faith & life with contemporary knowledge to nurture a community of distinguished & morally upright scholars who generate & propagate new knowledge for human development & social transformation. As a resource of Church & Nation, the institution endeavors to form Lasallian Achievers for God and Country who will lead in building a just, peaceful, stable & progressive Filipino nation."
    },
    {
        "Continent": "Asia",
        "Country": "S. Korea",
        "University": "Chung Ang University",
        "Description": "Chung-Ang University is a private institution with 30,000 students and 982 faculty members. It consists of 10 undergraduate colleges and 16 graduate schools. It operates two campuses, in Seoul and Anseong, Korea. It offers courses in Humanities, Social Sciences, Education, Natural Sciences, Biotechnology & Natural Resource, Engineering, ICT Engineering, Software, Business and Economics, Arts, Sport Sciences, Art & Technology"
    },
    {
        "Continent": "Asia",
        "Country": "S. Korea",
        "University": "Dongguk University",
        "Description": "Founded in 1906 by Korea's ecumenically minded Jogye Order, Dongguk University remains one of the few Buddhist affiliated universities in the world. Yet its doors have always been open to students and teachers of all faiths and philosophies. The university’s Seoul Campus is in the urban Jung District of Central Seoul. Dongguk University was ranked 77th among the Asian universities in 2015 QS World University Rankings, and 82nd in 2018. Dongguk Business School has obtained international recognition by acquiring Association to Advance Collegiate Schools of Business (AACSB) certificates. Overall, 20% of courses in Dongguk are taught in English. Business School & English department provides about 30% of lectures in English."
    },
    {
        "Continent": "Asia",
        "Country": "S. Korea",
        "University": "Ewha Womans University",
        "Description": "Even as late as the latter half of the 19th century, Korean women were deprived of formal education. The aim of Ewha Womans University's establishment was to free Korean women from feudalistic system and to give them a more humane life. Though Ewha has faced countless national hardships and crisis, both social and political in the past 118 years, Ewha has expanded women's opportunities for higher education and contributed to the modernization of Korean society and the improvement of women's lives through active social participation. Ewha began as a missionary school held in a private home, and is now the world's largest women's university with 140,000 graduates, 21,000 students, 14 colleges, 1division, and 14 graduate schools. Although students at Ewha are female, it accepts male students under the exchange umbrella (only). It is well known that those are very well treated there and rather delighted with their choice of studying at Ewha."
    },
    {
        "Continent": "Asia",
        "Country": "S. Korea",
        "University": "Hankuk University of Foreign Studies",
        "Description": "Hankuk University of Foreign Studies (HUFS), one of the leading private universities in South Korea, has two campuses in Seoul and Yongin. The reputation of school has mainly come from strength in social science and language areas. HUFS was founded as a college for studying foreign languages in 1954 with its first students studying English, French, Chinese, German and Russian. Through the 1960 and 70s, the college expanded its programmes and finally became a university in 1980. HUFS has continued to set up new language departments, graduate courses, and various research institutes. Now, there are more than 50 departments including Social Sciences, Eastern European Studies, Humanities, Asia-African Studies, and Natural Sciences. The University also contributes to regional studies, with graduate courses in international and regional studies. Since 2004 the closelyassociated Cyber University of Foreign Studies, based at Hankuk University of Foreign Studies, has been offering online courses in English, Japanese and Chinese, as well as Business Administration and Journalism and Mass Communication."
    },
    {
        "Continent": "Asia",
        "Country": "S. Korea",
        "University": "Inha University",
        "Description": "Inha University is a private university located in Incheon, the second largest port city in South Korea on the west coast with a population of 2,500,000. It is only 30 kilometers from Seoul. Inha University has passed through three stages of development: formation of Inha Institute of Technology in 1954, transformation of public into private college in the 1960s, and expansion into a university system in the 1970s. Since its origin Inha University has forged a unique place in the history of academics within Korea. Inha University offers a wide range of faculties, across 9 colleges with 15 schools and divisions and 17 departments, along with 7 graduate schools. It is recognized as one of the best universities in Korea by the Ministry of Education and Human Resources, and ranks as one of the nation’s top schools. Currently, it has a student enrollment of 16,332 undergraduate, 2,698 graduate and 82 international students, and a tenured faculty of 619 national and international staff members."
    },
    {
        "Continent": "Asia",
        "Country": "S. Korea",
        "University": "Korea University",
        "Description": "Korea University is South Korea’s largest private university & among the top ranked universities in the nation. It was founded in 1905 by Mr. Hae-Uoung Shin as Korea’s first institute for higher education. In 1946 it changed its name to 'Korea University' and in the same year, the university saw the founding of the College of Politics & Law, College of Economics and College of Liberal Arts. Today, Korea U has 18 colleges, 85 academic departments and 75 research institutes. These assets are spread across 4 campuses."
    },
    {
        "Continent": "Asia",
        "Country": "S. Korea",
        "University": "Kyung Hee University",
        "Description": "Kyung Hee University is a private research University with campuses in Seoul, Suwon (Global Campus) and Gwangneung. It has over 28,000 students and comprises 24 Colleges, 71 Departments & Majors, 65 Masters, 63 Doctoral Programs, 18 Professional & Special Graduate Schools and 43 Auxiliary Research Institutions. About 30% of the undergraduate courses are offered in English for exchange students."
    },
    {
        "Continent": "Asia",
        "Country": "S. Korea",
        "University": "Pusan National University",
        "Description": "Established by the national government in 1945 in Pusan, Korea’s second largest city. As of 1998, graduates of PNU totaled 89,632 bachelor degree holders. 12,755 master degree holders and 2399 doctoral scholars. It comprises 12 colleges, a general graduate school and 6 professional graduate schools."
    },
    {
        "Continent": "Asia",
        "Country": "S. Korea",
        "University": "Seoul National University",
        "Description": "Seoul National University (SNU) is and has been the indisputable leader of advanced education in Korea since its establishment in 1946. SNU has earned this reputation by maintaining the highest standards in both teaching and research. Kwanak Campus, the main campus of SNU, accommodates four graduate schools, eleven colleges, sixtysix research institutes, and other supporting facilities. Yeongeon campus is the medical campus which includes the University Hospital as well as other research institutes and organizations related to medical sciences. About 20,000 undergraduate students and 11,000 graduate students enroll at SNU every year. The faculty, consisting of 1800 professors and instructors from around the world, teaches students and conducts research at SNU."
    },
    {
        "Continent": "Asia",
        "Country": "S. Korea",
        "University": "Seoul National University (School of Law)",
        "Description": "Since its foundation in 1895, SNU School of Law has led the progress and advancement of legal scholarship and education in Korea along with the development of the Korean society at large, and produced excellent scholarship and educated some of the best jurists in the country. Our graduates have become leaders of the Korean legislature, administration, and judiciary, and are active in many other areas of the society. They have played, and are playing, a crucial role in the dazzling growth and development process of today's Korea. Our graduated have also been playing a leading role in legal scholarship and research. Now, together with the evolution of the global society, laws and legal research often transcend national boundaries. SNU School of Law has its mandate and mission to train and educate future scholars and legal professionals who would play an active role in the global stage."
    },
    {
        "Continent": "Asia",
        "Country": "S. Korea",
        "University": "Sogang University",
        "Description": "Sogang University is one of the leading research and liberal arts universities in South Korea. The university is a relatively new school, founded in 1960, and the only Jesuit institute of higher education in the country. The education offered at Sogang University is designed to form intellectuals who combine academic excellence and creative originality. It is designed to train citizens with outstanding leadership abilities, able to contribute to society and the nation in a spirit of devotion and a sense of responsibility, with mature and integrated characters, true cosmopolitans able to contribute to the national prosperity and world peace, equipped with an understanding of the changes the world is undergoing and the current of the times, and able to respond to them with sound critical judgment. Sogang University has 9 Colleges (Humanities, Social Sciences, Law, Communication, Natural Science, Engineering, Economics, Business Administration and General Education), and a student population just over 10,000 student (7,500 undergraduates and 3,000 postgraduates)."
    },
    {
        "Continent": "Asia",
        "Country": "S. Korea",
        "University": "Sungkyunkwan University",
        "Description": "For over six hundred years, Sungkyunkwan University has held an extraordinarily special place in the history of Korea. Since its establishment, the school’s educational tradition has emphasized the four principles of benevolence, righteousness, propriety, and wisdom. Sungkyunkwan University aims to raise the bar in research and education through international collaboration based upon these principles. Sungkyunkwan University strives to become a model university globally by upholding the traditional values of humanity along with the pursuit of modern contributions for humankind. Sungkyunkwan University has evolved to incorporate a modern educational paradigm that prioritizes cutting-edge research and innovative education. This has led to important advances in the arts, sciences, medicine, and technology in ways that allow greater synergy with other leading universities and institutions throughout the world."
    },
    {
        "Continent": "Asia",
        "Country": "S. Korea",
        "University": "Yonsei University",
        "Description": "Yonsei University has been located in Seoul, the capital of Korea, since the advent of the Chosun Dynasty 600 years ago. As the oldest university in Korea, Yonsei celebrated its 100th anniversary in 1985. It took its present form as an integrated university and medical complex in 1957 with the union of two major interdenominational institutions founded by Protestant missionaries to Korea, the Chosun Christian University and Severance Union Medical College. Yonsei University has grown from small beginnings to the multiversity of today, with 17 colleges, 83 departments and 13 professional graduate schools. The baccalaureate is offered in all 83 departments, the master’s degree in 69 departments and the 11 professional graduate schools, and the doctorate in 61 departments in the main Graduate School. The Yonsei family now includes 47,000 students."
    },
    {
        "Continent": "Asia",
        "Country": "S. Korea",
        "University": "Yonsei University (School of Law)",
        "Description": "Since 1885, Yonsei University has played a pivotal role in educating leaders. Yonsei Law School inherited the tradition and the proud history of the College of Law. Committed to the University’s values of truth and freedom, we train future legal professionals who will provide servant leadership in both the national and global arenas. Our education is designed to produce ethical leaders who promote democratic values and the rule of law, competent leaders who provide excellent services, and creative leaders who open new horizons of knowledge. Yonsei Law School seeks to train global legal practitioners who will have the insight and perspective to thrive in the international arena and provide innovative solution to the issues our world faces."
    },
    {
        "Continent": "Asia",
        "Country": "Taiwan",
        "University": "National Cheng Kung University",
        "Description": "National Cheng Kung University (NCKU), located in Tainan City and founded in 1931, is a leading comprehensive university in Taiwan with more than sixty departments in nine colleges covering the fields of Bioscience and Biotechnology, Electrical Engineering and Computer Science, Engineering, Liberal Arts, Management, Medicine, Planning and Design, Sciences and Social Sciences. As of February 2006, NCKU enrolls more than 20,000 students and has 1,178 faculties. The University offers a broad assortment of bachelor’s, master’s, and doctoral degree programs. The University’s educational goal is to lend the students the essentials of humanities, global vision, and independent thinking. NCKU’s research objective is to pursue innovation, to foster logical thinking, and to discover the unknown."
    },
    {
        "Continent": "Asia",
        "Country": "Taiwan",
        "University": "National Chengchi University",
        "Description": "Established in 1927, National Chengchi University (NCCU) is noted for its humanities and social sciences disciplines and currently housing 9 colleges, including liberal arts, science, social sciences, law, commerce, foreign languages & literature, communication, international affairs and education; 33 departments, 2 BA modules (Undergraduate Program in European Languages and College of Communication Undergraduate Degree Program), and 48 graduate institutes (including master’s module), with 32 graduate institutes offering PhD programs, 16 on-the-job master’s programs, and 5 English-taught degree programs (International Master’s Program in Taiwan Studies, International Master’s Program in China Studies, International Master of Business Administration, International Master’s Program in International Communication Studies, and International Doctor Program in Asia-Pacific Studies). There are more than 15000 students, 600 full-time teachers and 40 research fellows at NCCU."
    },
    {
        "Continent": "Asia",
        "Country": "Taiwan",
        "University": "National Chengchi University (College of Law)",
        "Description": "Established in 1927, National Chengchi University (NCCU) is noted for its humanities and social sciences disciplines and currently housing 9 colleges, including liberal arts, science, social sciences, law, commerce, foreign languages & literature, communication, international affairs and education; 33 departments, 2 BA modules (Undergraduate Program in European Languages and College of Communication Undergraduate Degree Program), and 48 graduate institutes (including master’s module), with 32 graduate institutes offering PhD programs, 16 on-the-job master’s programs, and 5 English-taught degree programs (International Master’s Program in Taiwan Studies, International Master’s Program in China Studies, International Master of Business Administration, International Master’s Program in International Communication Studies, and International Doctor Program in Asia-Pacific Studies). There are more than 15000 students, 600 full-time teachers and 40 research fellows at NCCU."
    },
    {
        "Continent": "Asia",
        "Country": "Taiwan",
        "University": "National Chiao Tung University",
        "Description": ""
    },
    {
        "Continent": "Asia",
        "Country": "Taiwan",
        "University": "National Sun Yat-Sen University",
        "Description": "In 1923, just two years before his untimely demise, the Founding Father of the Republic of China (ROC), Dr. Sun Yat-Sen, established two universities, one civil and one military. The civil university was Kwangtung University (renamed Chungshan University in 1926), and the military university was Whampoa Military Academy. Both universities generated remarkable contributions and played an important education role in modern Chinese history. In 1949, the government of the ROC moved to Taiwan. The National Sun Yet-Sen University (NSYSU) was meant to be re-established, but the right timing never came along until 1980, when Dr. Huan Li established the university on its current campus at Hsitzu Bay in Kaohsiung. When it was established, the university had four departments, two graduate institutes, and 189 students. Today, the university has six colleges (Liberal Arts, Sciences, Engineering, Management, Marine Sciences, and Social Sciences) and over 9300 students, offering 19 undergraduate majors, 34 master programs, and 26 doctorate programs. NSYSU has grown tremendously and recognized as one of Taiwan's important research and learning institution with international distinction."
    },
    {
        "Continent": "Asia",
        "Country": "Taiwan",
        "University": "National Taiwan Normal University",
        "Description": "NTNU is a dynamic university, offering top quality education and research opportunities to those who study there. Originally founded in 1946, as the provincial Taiwan Teachers College, NTNU continues to uphold the highest of standards for the preparation of teachers and intellectuals, that it committed itself to in 1967, when it became a National University. After the enactment of the Teacher Preparation Law in 1994, NTNU revitalized many of its programs, resulting in the ongoing process of offering students chances to broaden their academic horizons, with the commitment to mentoring and preparing its students for the challenges of the 21st century. Over the past five decades, NTNU has played a leading role not only in the growth of Taiwan's higher and secondary education, but also with the international university community. It has been able to establish links with numerous prestigious educational institutions from around the world. Through such programs, NTNU has shown that it is taking active steps to become an international university."
    },
    {
        "Continent": "Asia",
        "Country": "Taiwan",
        "University": "National Taiwan University",
        "Description": "The predecessor of National Taiwan University was Taihoku (Taipei) Imperial University, founded by the Japanese in 1928. When Taihoku University was first established, it had two colleges (Liberal Arts and Law; Science and Agriculture) and 60 students. Today the University has a total of eleven colleges, 54 departments, 96 graduate institutes (which offer 96 Master's programs and 83 doctoral programs), and four research centers. The number of students is over 30,000 and a new library was built in 1998, and it now contains over 3,000,000 volumes of books."
    },
    {
        "Continent": "Asia",
        "Country": "Taiwan",
        "University": "National Taiwan University (College of Law)",
        "Description": "The predecessor of National Taiwan University was Taihoku (Taipei) Imperial University, founded by the Japanese in 1928. When Taihoku University was first established, it had two colleges (Liberal Arts and Law; Science and Agriculture) and 60 students. Today the University has a total of eleven colleges, 54 departments, 96 graduate institutes (which offer 96 Master's programs and 83 doctoral programs), and four research centers. The number of students is over 30,000 and a new library was built in 1998, and it now contains over 3,000,000 volumes of books."
    },
    {
        "Continent": "Asia",
        "Country": "Taiwan",
        "University": "National Taiwan University (College of Management)",
        "Description": "The predecessor of National Taiwan University was Taihoku (Taipei) Imperial University, founded by the Japanese in 1928. When Taihoku University was first established, it had two colleges (Liberal Arts and Law; Science and Agriculture) and 60 students. Today the University has a total of eleven colleges, 54 departments, 96 graduate institutes (which offer 96 Master's programs and 83 doctoral programs), and four research centers. The number of students is over 30,000 and a new library was built in 1998, and it now contains over 3,000,000 volumes of books."
    },
    {
        "Continent": "Asia",
        "Country": "Taiwan",
        "University": "National Taiwan University (College of Social Science)",
        "Description": "The predecessor of National Taiwan University was Taihoku (Taipei) Imperial University, founded by the Japanese in 1928. When Taihoku University was first established, it had two colleges (Liberal Arts and Law; Science and Agriculture) and 60 students. Today the University has a total of eleven colleges, 54 departments, 96 graduate institutes (which offer 96 Master's programs and 83 doctoral programs), and four research centers. The number of students is over 30,000 and a new library was built in 1998, and it now contains over 3,000,000 volumes of books."
    },
    {
        "Continent": "Asia",
        "Country": "Thailand",
        "University": "Mahidol University International College",
        "Description": "Mahidol University has its origins in the establishment of Siriraj Hospital in 1888 by His Majesty King Chulalongkorn (Rama V), and the hospital’s medical school is the oldest institution of higher learning in Thailand, granting its first medical degree in 1893. Later becoming the University of Medical Sciences in 1943, Mahidol University was renamed with great honor in 1969 by H.M. King Bhumibol Adulyadej, after his Royal Father, H.R.H Prince Mahidol of Songkla, who is widely known as the ‘Father of Modern Medicine and Public Health in Thailand’. Mahidol University has since developed into one of the most prestigious universities in Thailand, internationally known and recognized for the high caliber of research and teaching by its faculty, and its outstanding achievements in teaching, research, international academic collaboration and professional services. This diversified institution now offers top quality programs in numerous social and cultural disciplines, including the most doctoral programs of any institution in Thailand, yet has maintained its traditional excellence in medicine and the sciences."
    },
    {
        "Continent": "Asia",
        "Country": "Thailand",
        "University": "Thammasat University",
        "Description": "Thammasat University is located on the Chao Phya River in central Bangkok. It was founded in 1933 and is the second oldest of state universities. Thammsat Business School is considered one of the best business school in Thailand, and it was awarded with the EQUIS Accreditation in 2012, the AACSB Accreditation in 2017, and the AMBA Accreditation in 2018 respectively. Thammasat Business School is the only business school in Thailand selected to join a prestigious community of leading business schools – Partnership in International Management, a consortium of top business schools from around the world that exchanges top–quality undergraduate and graduate students between Thammasat Business School and top-tier partner universities. "
    },
    {
        "Continent": "Asia",
        "Country": "Thailand",
        "University": "Chulalongkorn University",
        "Description": "Chulalongkorn University is the oldest and the most prestigious university in Thailand. It was founded in 1917 and named after King Chulalongkorn. The university’s modern campus covers 500 acres, which is within easy reach of the major business and financial district of Bangkok, the capital city and it is 45 minutes by expressway to Chulalongkorn University."
    },
    {
        "Continent": "AustraliaOceania",
        "Country": "Australia",
        "University": "Australian National University",
        "Description": "The Australian National University (ANU) is one of the world’s most highly-respected universities. It has been consistently ranked first in the Southern Hemisphere by the QS World University Rankings. As the only Australian member of the International Alliance of Research Universities (IARU), ANU students and staff have many opportunities for collaboration and exchange that contribute to the University’s rich intellectual climate. ANU has links with leading universities in the US, UK, Europe and Asia. ANU is also a member of the Group of Eight (Go8), which is a coalition of leading Australian universities, comprehensive in general and professional education and distinguished by depth and breadth in research. "
    },
    {
        "Continent": "AustraliaOceania",
        "Country": "Australia",
        "University": "Monash University",
        "Description": "Monash University is an Australian public research university based in Melbourne, Australia, and is the second oldest university in the State of Victoria. Monash is a member of Australia's Group of Eight, a coalition of Australia's eight leading research Universities, a member of the ASAIHL, and is the only Australian member of the influential M8 Alliance of Academic Health Centers, Universities and National Academies. Monash is one of two Australian universities to be ranked in the École des Mines de Paris (Mines ParisTech) ranking on the basis of the number of alumni listed among CEOs in the 500 largest worldwide companies "
    },
    {
        "Continent": "AustraliaOceania",
        "Country": "Australia",
        "University": "The University of Queensland",
        "Description": "The University of Queensland (UQ) is one of Australia’s leading research and teaching institutions. We strive for excellence through the creation, preservation, transfer and application of knowledge. For more than a century, we have educated and worked with outstanding people to deliver knowledge leadership for a better world."
    },
    {
        "Continent": "AustraliaOceania",
        "Country": "Australia",
        "University": "University of Melbourne, Faculty of Arts",
        "Description": "Studying at the University of Melbourne provides students with a rich academic and social experience on a wonderful campus in the midst of a city with a great lifestyle. Melbourne, the capital of the state of Victoria, is Australia's second-largest city. It is vibrant, culturally diverse and characterised by its friendly people and atmosphere. The University of Melbourne is five minutes from the centre of Melbourne, a leafy campus with cafés, shops and spectacular architecture. With great public transportation, you'll feel right at home anywhere in the city. "
    },
    {
        "Continent": "AustraliaOceania",
        "Country": "Australia",
        "University": "University of Melbourne, Faculty of Business and Economics (FBE)",
        "Description": "Studying at the University of Melbourne provides students with a rich academic and social experience on a wonderful campus in the midst of a city with a great lifestyle. Melbourne, the capital of the state of Victoria, is Australia's second-largest city. It is vibrant, culturally diverse and characterised by its friendly people and atmosphere. The University of Melbourne is five minutes from the centre of Melbourne, a leafy campus with cafés, shops and spectacular architecture. With great public transportation, you'll feel right at home anywhere in the city. "
    },
    {
        "Continent": "AustraliaOceania",
        "Country": "Australia",
        "University": "University of New South Wales",
        "Description": "UNSW was established in 1949 as part of a post World War II education boom in Australia. UNSW quickly became a leader in the areas of science, engineering and technology. In its short history, UNSW has soared to becoming one of the most respected universities in Australia and the Pacific region and proudly describes itself as “Australia’s most international campus,” with almost five percent of the campus coming from overseas. The campus itself services approximately 26,000 students. Every nation in the Pacific Rim is represented, as well as drawing a healthy number of students from Europe, the Americas and Africa. Despite its size UNSW boasts a 12:1 student/faculty ratio. UNSW occupies an 85-acre, hilltop site in the Kensington area of Sydney. UNSW is about 20 minutes east of downtown Sydney and about 5 minutes west of Coogee (coo-g) Beach. "
    },
    {
        "Continent": "AustraliaOceania",
        "Country": "Australia",
        "University": "University of New South Wales, Faculty of Law",
        "Description": "UNSW was established in 1949 as part of a post World War II education boom in Australia. UNSW quickly became a leader in the areas of science, engineering and technology. In its short history, UNSW has soared to becoming one of the most respected universities in Australia and the Pacific region and proudly describes itself as “Australia’s most international campus,” with almost five percent of the campus coming from overseas. The campus itself services approximately 26,000 students. Every nation in the Pacific Rim is represented, as well as drawing a healthy number of students from Europe, the Americas and Africa. Despite its size UNSW boasts a 12:1 student/faculty ratio. UNSW occupies an 85-acre, hilltop site in the Kensington area of Sydney. UNSW is about 20 minutes east of downtown Sydney and about 5 minutes west of Coogee (coo-g) Beach. "
    },
    {
        "Continent": "AustraliaOceania",
        "Country": "Australia",
        "University": "University of Sydney",
        "Description": "The University of Sydney (USYD), founded in 1850, is Australia's first university, and has an international reputation for outstanding teaching, as a centre of research excellence and as an active and engaged community leader. The University has 45,000 students (8,000 international students) and 13 Faculties (/Schools). USYD continues to rise in global rankings, confirming its place within the top 40 universities in the world: the University’s humanities teaching and research was ranked fifth best in the world in the UK’s Times Higher Education Supplement (THES) World University Rankings published in October 2006, while the University as a whole was ranked 35th in the world in the same league table. In the Newsweek global 100 for 2006, the University of Sydney was one of two Australian universities placed in the top 50 in the world. "
    },
    {
        "Continent": "America",
        "Country": "Canada",
        "University": "Brock University",
        "Description": "Brock University is located at St. Catharines Ontario Canada and it is 20 minutes away from the Niagara Falls and about 75 minutes from downtown Toronto. Brock offers a range of courses in all functional areas including Accounting, Finance, Human Resource Management, Marketing, General Management, Entrepreneurship, International Business, Information Systems, Operations Management."
    },
    {
        "Continent": "America",
        "Country": "Canada",
        "University": "Concordia University",
        "Description": "Concordia University (commonly referred to as Concordia) is a Canadian public comprehensive university with campuses and facilities in Montreal, Quebec, Canada. Concordia University was formed on August 24, 1974 through the merger of Loyola College (1896) and Sir George Williams University (1926). The university has two campuses, set approximately seven km apart: Sir George Williams Campus in the downtown core of Montreal, in an area known as Quartier Concordia and Loyola Campus in the residential district of Notre-Dame-de-Grâce. With four faculties, a school of graduate studies and numerous colleges, centers and institutes, Concordia offers over 300 undergraduate and 100 graduate programs and courses."
    },
    {
        "Continent": "America",
        "Country": "Canada",
        "University": "HEC Montreal",
        "Description": "HEC Montréal has every reason to be proud: its status as a major international school has been recognized for the third time, with AACSB International accreditation. This comes on top the EQUIS accreditation and recognition from AMBA, making our institution the only business school in North America to boast this triple quality benchmark. Recognition by each of these three organizations confirms not only the quality of the programs we offer and the calibre of our students and faculty, but also the School’s exceptional support for students. This threefold distinction makes HEC Montréal not only the standard in the world of business in Quebec, but a model for all of North America."
    },
    {
        "Continent": "America",
        "Country": "Canada",
        "University": "McGill University",
        "Description": "McGill University is one of Canada's best-known institutions of higher learning and one of the leading researchintensive universities. With students coming to McGill from about 150 countries, our student body is the most internationally diverse of any medical-doctoral university in Canada. The oldest university in Montreal, McGill was founded in 1821 from a generous bequest by James McGill, a prominent Scottish merchant. Since that time, McGill has grown from a small college to a bustling university with two campuses, 11 faculties, some 300 programs of study, and more than 36,000 students."
    },
    {
        "Continent": "America",
        "Country": "Canada",
        "University": "Queens University",
        "Description": "Queen's historic main campus: located in the city of Kingston, crossroads between 3 major urban Canadian centres: Toronto, Montreal, Ottawa. First principal Thomas Liddell (1841- 46) arrives from Scotland carrying Queen Victoria's Royal Charter. Queen's College opens in 1842 on Colborne Street to a few students and one professor, Peter Colin Campbell, to assist the principal. Since 1841, Queen's has played a pivotal role in developing national leaders. From our ivy-covered buildings, students go out into the world to achieve greatness in their own lives, help shape their country's destiny, and make a lasting difference in society."
    },
    {
        "Continent": "America",
        "Country": "Canada",
        "University": "Simon Fraser University (Beedie School of Business)",
        "Description": "In the place where innovative education, cutting-edge research and community outreach intersect, you'll find Simon Fraser University. Our vision? To be Canada's leading engaged university. Born in 1965, SFU has become Canada's leading comprehensive university with vibrant campuses in British Columbia's largest municipalities — Vancouver, Burnaby and Surrey — and deep roots in partner communities throughout the province and around the world."
    },
    {
        "Continent": "America",
        "Country": "Canada",
        "University": "Université Laval",
        "Description": "Located in one of North America’s most vibrant and historic French-speaking cities, FSA ULaval is leading the way towards a new concept for business administration, as Québec’s unique position offers both an international outlook and proximity to major centres of innovation. The Université Laval campus is one of the most striking in Québec. It covers 1.2 km2 and has over 30 pavilions, all linked by 10 km of underground walkways. It features an expansive sports complex, a library, a bank, a student computer center, a service building (pub, restaurants, cafeteria, hair salon, bookstore, etc.), and the campus serves as a major hub for public transit."
    },
    {
        "Continent": "America",
        "Country": "Canada",
        "University": "University of Alberta, Alberta School of Business",
        "Description": "Founded in 1908, the University of Alberta in Edmonton is one of Canada's top teaching and research universities. The Alberta School of Business was the first business school in Canada to receive AACSB accreditation in 1968. In 2013 the Financial Times of London ranked us top ten in research for publicly-funded universities; our MBA, Executive MBA and PhD programs are consistently ranked top 100 globally. In 2013 we also launched the University of Alberta's first international degree - the Master of Financial Management in China. Leaders from Alberta for the World is our vision; energy, entrepreneurship and global impact are our priority areas."
    },
    {
        "Continent": "America",
        "Country": "Canada",
        "University": "University of British Columbia - Faculty of Arts",
        "Description": "The University of British Columbia (UBC) is situated in Vancouver, a thriving port city of 1.8 million people, on the West Coast of Canada, about a 3-hour drive from Seattle, Washington. It is one of Canada’s leading research universities offering a comprehensive range of undergraduate, post-graduate and professional programs through 12 faculties and 11 schools."
    },
    {
        "Continent": "America",
        "Country": "Canada",
        "University": "University of British Columbia - Saunder School of Business",
        "Description": "The University of British Columbia (UBC) is situated in Vancouver, a thriving port city of 1.8 million people, on the West Coast of Canada, about a 3-hour drive from Seattle, Washington. It is one of Canada’s leading research universities offering a comprehensive range of undergraduate, post-graduate and professional programs through 12 faculties and 11 schools."
    },
    {
        "Continent": "America",
        "Country": "Canada",
        "University": "Univeristy of Victoria",
        "Description": "The University of Victoria, commonly called UVic, is one of Canada’s top universities, committed to excellence in teaching, research, and community service. As a young university, UVic has had the opportunity to develop innovative programs in interdisciplinary research, professional schools, cooperative education, and many other areas. The university community consists of 790 full-time faculty, 2900 full and part-time staff, and over 18,000 students of which close to 1000 are international. Because of its size and diversity, the university is a very friendly and comfortable place to live and study. UVic is favoured by its location; the harbour city of Victoria, on the southern tip of Vancouver Island, overlooks the Pacific Ocean and the snow-capped Olympic Mountains. The temperate climate, spectacular scenery and serene yet cosmopolitan atmosphere of the Victoria area are ideal for study, personal growth, recreation, and social exchange. On campus you can jog year round on chip trails through the woods surrounding part of the 381 acre campus, or stroll down to sandy beaches and pleasant shopping villages a short distance away"
    },
    {
        "Continent": "America",
        "Country": "Canada",
        "University": "University of Calgary",
        "Description": "The roots of The University of Calgary extend back to the Calgary Normal School, which opened in January 1906. A Calgary branch of the University of Alberta was established in 1945 and began offering Arts and Science courses in 1951, but it was 1960 before any buildings were opened on the present site. When the first buildings were officially opened in October 1960, student enrolment stood at 1,075 with an academic and administrative staff of 100. By the time the university gained full autonomy in 1966, programs were offered in Arts and Science, Education, Engineering and Graduate Studies. In addition, Departments of Business and Physical Education offered instruction towards degrees awarded by the University of Alberta. By 1969 the University had established the Environmental Sciences Centre at Kananaskis, Schools of Social Welfare and Physical Education as well as Faculties of Business, Fine Arts, and Medicine."
    },
    {
        "Continent": "America",
        "Country": "Canada",
        "University": "University of Manitoba",
        "Description": "The University of Manitoba was established in 1877, and the population of the province was less than 60,000 people, there was no reason to predict the university would grow so large that today it can be described as Manitoba’s third largest city. Today western Canada’s oldest university has two locations. The main campus in the south Winnipeg suburb of For Garry covers 274 hectares on the banks of the Red River. The second location is a complex of ten buildings called the Bannatyne Campus in central Winnipeg. Although the replacement cost of the university’s physical facilities is now estimated at $1 billion, the University of Manitoba led a nomadic existence during its first decade in borrowed or rented rooms. In these early years the university didn’t really need its own facilities because it was established when three church colleges – St. John’s College, St. Boniface college, and Manitoba College – petitioned the Manitoba legislature to set up an examination and degree granting agency."
    },
    {
        "Continent": "America",
        "Country": "Canada",
        "University": "Western University (Richard Ivey School of Business)",
        "Description": "The Richard Ivey School of Business (Ivey) offers degree programs at the undergraduate level (Honours Business Administration) and post graduate levels (12-Month MBA, Executive MBA and PhD) as well as non-degree open enrollment and customized corporate programs through its Executive Development facilities in London, Toronto and Hong Kong. Ivey is affiliated with the Western University with its main campus located in London, Ontario, midway between Toronto and Detroit. The business school also has three executive teaching facilities: Ivey's ING Leadership Centre located in the Exchange Tower in Toronto’s financial district, at the Spencer Leadership Centre in London and the Cheng Yu Tung Management Institute in the Hong Kong Convention and Exhibition Centre, where it offers both Executive MBA and Executive Development programs"
    },
    {
        "Continent": "America",
        "Country": "Canada",
        "University": "York University",
        "Description": "Founded in 1959, York University is now Canada’s third largest university. York offers full and part-time graduate and undergraduate degree programs to nearly 50,000 students through ten faculties. To name a few: the Faculty of Arts is the largest in Canada; the Faculty of Fine Arts is the largest and one of the most renowned in Ontario. The Schulich School of Business is ranked among the top business schools in the world. The Faculty of Graduate Studies is Ontario’s second largest graduate school, and it offers both traditional and non-traditional interdisciplinary areas of study."
    },
    {
        "Continent": "America",
        "Country": "Canada",
        "University": "University of Toronto",
        "Description": "The University of Toronto is a global leader in research and teaching. We provide diverse and extensive areas of study organized around smaller, intimate learning communities. That is what creates an exceptional learning environment for our students. One university, three campuses, 90,000+ enrolled students from 160+ countries, 14,000+ faculty, 7,000+ staff, over 800+ student clubs, and the 3rd largest library system in North America."
    },
    {
        "Continent": "America",
        "Country": "USA",
        "University": "Arizona State University",
        "Description": "Arizona State University was founded in March 1885. After years of expensive growth in enrollment, academic programs and research initiatives, ASU has become one of the leading research universities in America, developing nationally recognized programs in a number of fields. The university libraries have rich collections of books, microform units and periodical and serial subscriptions."
    },
    {
        "Continent": "America",
        "Country": "USA",
        "University": "Babson College",
        "Description": "Babson College, located in Wellesley, Massachusetts, is recognized internationally for its entrepreneurial leadership in a changing global environment. Babson grants BS degrees through its innovative undergraduate program. It grants MBA and custom MS and MBA degrees through F.W Olin Graduate School of Business at Babson College. Both programs are accredited by the AACSB International – The Association to Advance Collegiate Schools of Business and the New England Association of Programs, Consortium Programs and Open-Enrollment Programs."
    },
    {
        "Continent": "America",
        "Country": "USA",
        "University": "Boston University",
        "Description": "Boston University is an international, comprehensive, private research university, committed to educating students to be reflective, resourceful individuals ready to live, adapt, and lead in an interconnected world. Boston University is committed to generating new knowledge to benefit society. Boston University comprises a remarkable range of undergraduate, graduate, and professional programs built on a strong foundation of the liberal arts and sciences. With the support and oversight of the Board of Trustees, the University, through their faculty, continually innovates in education and research to ensure that they meet the needs of students and an ever-changing world."
    },
    {
        "Continent": "America",
        "Country": "USA",
        "University": "City University of New York - Baruch College",
        "Description": "Baruch College is ranked among the region's and nation's top colleges by U.S. News & World Report, Forbes, Princeton Review, and others. The campus is within easy reach of Wall Street, Midtown, and the global headquarters of major companies and non-profit and cultural organizations, giving students unparalleled internship, career, and networking opportunities. The College's more than 18,000 students, who speak more than 110 languages and trace their heritage to more than 170 countries, have been repeatedly named one of the most ethnically diverse student bodies in the United States."
    },
    {
        "Continent": "America",
        "Country": "USA",
        "University": "Emory University",
        "Description": "Led by President William M. Chace, an award-winning teacher and scholar. Emory was founded at Oxford by the Methodist Church in 1836. The 631-acre Atlanta campus, located 15 minutes from downtown Atlanta, is positioned along the Clifton Corridor, which also includes the US Centers for Disease Control and Prevention and the American Cancer Society. Emory’s Robert W. Woodruff Health Sciences Center includes Emory HealthCare, the most comprehensive health care delivery system in Atlanta. One of SMU’s Ex-Presidents, Prof. Ron Frank, was the Dean at Emory University, where he initiated key sponsorship efforts. These led to the naming of the school of Roberto C. Goizueta in response to a US$10 million gift from the Robert W. Woodruff Foundation."
    },
    {
        "Continent": "America",
        "Country": "USA",
        "University": "North Carolina State University",
        "Description": ""
    },
    {
        "Continent": "America",
        "Country": "USA",
        "University": "Northeastern University",
        "Description": "Founded in 1898, Northeastern University is a private research university located in the heart of Boston, and a leader in interdisciplinary research, urban engagement, and the integration of classroom learning with real-world experience. Their signature cooperative education program, one of the largest and most innovative in the world, is ranked among the best in the nation by U.S. News & World Report. Northeastern University offers a comprehensive range of undergraduate and graduate programs leading to degrees through the doctorate in six undergraduate colleges, eight graduate schools, and two part-time divisions."
    },
    {
        "Continent": "America",
        "Country": "USA",
        "University": "Ohio State University",
        "Description": "Founded in 1916, the college has evolved through significant organizational changes. Ohio State's roots go back to 1870, when the Ohio General Assembly established the Ohio Agricultural and Mechanical College. The new college was made possible through the provisions of the Land-Grant Act, signed by President Lincoln on July 2, 1862. This legislation revolutionized the nation's approach to higher education, bringing a college degree within reach of all high school graduates. The college's curriculum was a matter of bitter dispute among politicians, the public, and educators. One faction, the 'narrow gauge' group, held that the college should devote itself solely to the teaching of agriculture and mechanical arts. The 'broad gauge' faction wanted a wider program that featured English and ancient and foreign languages as well. Joseph Sullivant, a member of the first Board of Trustees, pushed the 'broad gauge' idea through the Board of Trustees, where it passed by a margin of 8-7. His legacy endures; Ohio State continues to offer a broad-based, liberal arts education and a diverse range of study."
    },
    {
        "Continent": "America",
        "Country": "USA",
        "University": "Oregon State University",
        "Description": "Oregon State University (OSU; student pop. 20,000) is a coeducational, public and research university. The university offers undergraduate, graduate and doctoral degrees and a multitude of research opportunities. There are over 200 academic degree programmes offered through the university. OSU's programs in nuclear engineering, ecology, forestry, public health, biochemistry, zoology, oceanography, food science and pharmacy are recognized nationally as top tier programs. Over 200,000 people have attended OSU since its founding. The Carnegie Foundation classifies Oregon State University as a 'very high research activity; university. Oregon State is one of 73 land-grant universities currently operating throughout the world. The school is also recognized as a sea-grant, space-grant and sun-grant institution, making it one of only two US institutions to retain all four designations and the only public university to do so (Cornell is the only other with similar designations). In addition to Oregon State's many federally designated areas of research, the university receives more funding for research, annually, than all the state's other public higher educational institutions combined."
    },
    {
        "Continent": "America",
        "Country": "USA",
        "University": "Pitzer College",
        "Description": ""
    },
    {
        "Continent": "America",
        "Country": "USA",
        "University": "University of Florida",
        "Description": "The University of Florida is the state’s oldest, largest and most comprehensive university. UF is among the nation’s most academically diverse public universities. Florida has a long history of established programs in international education, research and service. Enrollment for fall semester for 2001 totaled more than 45,000 students, with approximately 2,500 international students representing over 100 countries. Approximately 150 exchange students studied at UF for the 2000 school year. The ratio of women to men is currently 51:49. Seventy-five percent of enrolled students are undergraduates, 18 percent are graduate students and 7 percent are in professional degree programs (including dentistry, law, medicine, pharmacy and veterinary medicine). Approximately 22 percent of the members of the UF student body are minorities with 6.5 percent of the student population consisting of AfricanAmerican students, 9.4 percent Hispanic students, and 6.0 percent Asian American or Pacific Islander students."
    },
    {
        "Continent": "America",
        "Country": "USA",
        "University": "University of Maryland",
        "Description": "The University of Maryland is the flagship campus of the state’s higher educational system and a top-ranked public research institution. They are a diverse community of 38,000 students, 9,000 faculty and staff, and 352,000 alumni, all dedicated to the pursuit of Fearless Ideas. Located just outside Washington, D.C., they discover and share new knowledge every day through their renowned research enterprise and programs in academics, the arts and athletics."
    },
    {
        "Continent": "America",
        "Country": "USA",
        "University": "University of Minnesota",
        "Description": "The Carlson School of Management, the business school of the University of Minnesota, was founded in 1919. It is the only nationally accredited business school in the Twin Cities (Minneapolis/St. Paul) area. The Carlson School has a distinguished faculty, and important connections to several major Fortune 500 corporations headquartered in the Twin Cities, including Cargill, Medtronic, the 3M Company, the General Mills. In addition to its regular degree programs, the Carlson School of Management offers a joint degree program with the Warsaw School of Economics and the Wirtschaftsuniversitat Wien in Vienna, and Lingnan University in China. In 1998, the Carlson School of Management built a new state-of-the art building utilizing the most up-to-date technology in all classrooms."
    },
    {
        "Continent": "America",
        "Country": "USA",
        "University": "University of North Carolina, Chapel Hill",
        "Description": "The nation’s first public university is at the heart of what’s next, preparing a diverse student body to become creators, explorers, innovators and leaders in North Carolina and throughout the world. Carolina’s nationally recognized, innovative teaching, campus-wide spirit of inquiry and dedication to public service continue the legacy that began in 1795 when the University first opened its doors to students. In Chapel Hill, students develop a voice for critical thought and the courage to guide change. They connect to the future they’re already shaping."
    },
    {
        "Continent": "America",
        "Country": "USA",
        "University": "University of Oregon",
        "Description": "The University of Oregon (UO) is a comprehensive research university, which enrolls approximately 25,000 students. International students represent about ten percent of the student population. The University offers high quality programs of undergraduate and graduate instruction in the liberal arts and sciences, as well as professional preparation in the fields of Architecture and Allied Arts (including Planning, Public Policy and Management (PPPM)), Business Administration, Education, Journalism, Law, and Music. The College of Arts and Sciences includes majors such as Economics, English, Environmental Studies, History, International Studies, Linguistics,and Political Science. The UO is located in Eugene, Oregon, a city with a population of about 156,000 people at the southern end of the Willamette River Valley. Eugene is about two hours driving time south of Portland (with a population of 2.2 million) and lies between the Cascade Mountains to the east and the Pacific Ocean to the west. The Eugene area offers miles of bicycle paths and jogging trails, and a campus and community rich in cultural resources."
    },
    {
        "Continent": "America",
        "Country": "USA",
        "University": "University of Pennsylvania (Wharton School)",
        "Description": "America's first university began with a radical idea: that students should be educated not just in the classics or as a path to the priesthood, but in contemporary subjects in a non-sectarian setting. Penn's founder, Benjamin Franklin, put it more succinctly: Students should learn 'everything that is useful and everything that is ornamental'. Penn has a history of educational innovation consistent with Franklin's instructions, including the nation's first medical school, its first business school, the first university teaching hospital and the first modern liberal-arts curriculum."
    },
    {
        "Continent": "America",
        "Country": "USA",
        "University": "University of Richmond",
        "Description": "Founded in 1830, the University of Richmond provides a collaborative learning and research environment unlike any other in higher education, offering students an extraordinary combination of the liberal arts with law, business, leadership studies, and continuing education. It is characterized by a distinctly integrated student experience—a rich and innovative life for students inside and outside the classroom—and a welcoming spirit that prizes diversity of experience and thought. It is rooted in a determination to engage as a meaningful part of our community and our world. It is committed to ensuring its opportunities are accessible to talented students of all backgrounds."
    },
    {
        "Continent": "America",
        "Country": "USA",
        "University": "University of Southern California (Marshall School of Business)",
        "Description": "The USC Marshall School of Business is a private research and academic institution committed to educating tomorrow's global leaders. Ranked as one of the country's top school's for accounting, finance, entrepreneurship and international business studies, Marshall also shares the rich history and vibrant community of the USC academic system. Located in Los Angeles, a global center for arts, technology and international trade, the University of Southern California is one of the world’s leading private research universities. USC enrolls more international students than any other U.S. university and offers extensive opportunities for internships and study abroad. With a strong tradition of integrating liberal and professional education, USC fosters a vibrant culture of public service and encourages students to cross academic as well as geographic boundaries in their pursuit of knowledge."
    },
    {
        "Continent": "America",
        "Country": "USA",
        "University": "Washington University in St. Louis",
        "Description": "Washington University in St. Louis (Wash U, WUSTL) is a private research university located in suburban St. Louis, Missouri. Founded in 1853, and named for George Washington, the university has students and faculty from all fifty U.S. states and more than 110 nations. Washington University is made up of seven graduate and undergraduate schools that encompass a broad range of academic fields. The Olin Business School is one of seven academic schools at Washington University in St. Louis. Founded in 1917, the business school was renamed for entrepreneur John M. Olin in 1988. The school offers BSBA, MBA, MS in Supply Chain Management, and MS in Finance, Masters in Accounting, Executive MBA, and PhD degrees. Olin has been consistently ranked among the world's top business schools. The Olin Business School is located in Simon Hall on the Danforth campus of Washington University in St. Louis."
    },
    {
        "Continent": "America",
        "Country": "Brazil",
        "University": "FGV EBAPE"
    },
    {
        "Continent": "America",
        "Country": "Brazil",
        "University": "Insper Institute of Education and Research"
    },
    {
        "Continent": "America",
        "Country": "Mexico",
        "University": "Technologico de Monterrey"
    },
    {
        "Continent": "America",
        "Country": "Peru",
        "University": "Universidad del Pacifico"
    },
    {
        "Continent": "MiddleEast",
        "Country": "Israel",
        "University": "Interdisciplinary Center Herzliya",
        "Description": "Since its establishment, IDC Herzliya has been an academic avant-garde. As such, its faculty takes part in the crucial process that is reshaping the Israeli nation, dealing with constitutional & governmental reconstruction, economic growth, re-evaluation of Israel’s strategy & policies of foreign relations, as well as the country’s social & moral agenda. IDC is unique in its educational methods, which are based on an interdisciplinary approach, teaching of information technology & global markets. IDC combines theory with real world experience and provides students with proficiencies. IDC’s basic outlook, which is rooted in the twin concepts of individual freedom & responsibility, emphasizes student’s entrepreneurship & leadership alongside commitment to community service. "
    },
    {
        "Continent": "MiddleEast",
        "Country": "Israel",
        "University": "Interdisciplinary Center, Herzliyah (Faculty of Law)",
        "Description": "Since its establishment, IDC Herzliya has been an academic avant-garde. As such, its faculty takes part in the crucial process that is reshaping the Israeli nation, dealing with constitutional & governmental reconstruction, economic growth, re-evaluation of Israel’s strategy & policies of foreign relations, as well as the country’s social & moral agenda. IDC is unique in its educational methods, which are based on an interdisciplinary approach, teaching of information technology & global markets. IDC combines theory with real world experience and provides students with proficiencies. IDC’s basic outlook, which is rooted in the twin concepts of individual freedom & responsibility, emphasizes student’s entrepreneurship & leadership alongside commitment to community service. "
    },
    {
        "Continent": "MiddleEast",
        "Country": "Israel",
        "University": "Tel Aviv University - Faculty of Law",
        "Description": "Located at the heart of Tel Aviv, TAU Law Faculty is Israel’s premier law school. It offers an environment of excellence and educational intimacy in the form of renowned faculty, vibrant student life, ample opportunities for clinical training, and extracurricular activities. Small by design, the faculty’s impact on the legal world is measured by its accomplished graduates and its ongoing scholarship and outreach through numerous centers and projects. TAU faculty publish in the most prestigious law reviews and university presses and lecture regularly at leading law schools in the United States and Europe. Our faculty’s scholarship has a significant and continuing impact on Israeli law and is widely discussed by academics abroad. At the same time, TAU is a pioneer in the Israeli legal academy in pursuing important social causes through its vibrant legal clinics as well as its innovative admissions procedures. A TAU Law education prepares students for success in the practice of law, business, public service, and teaching. Through its faculty, students, and alumni, TAU Law Faculty is able to contribute solutions to the world's most complex legal and social challenges. Among the Faculty’s graduates are Supreme Court Judges, premier law practitioners and Members of Parliament."
    },
    {
        "Continent": "MiddleEast",
        "Country": "Turkey",
        "University": "KOC University",
        "Description": "Koç university is a private, nonprofit institution, founded in 1993 and located in Istanbul. The University is supported by the financial resources of the Vehbi Koc Foundation, set up by Vehbi Koc, a leading Turkish businessman, 'to serve humanity by increasing the number of people who can of service to the Turkish nation,' and is committed to the pursuit of excellence in both teaching and research. In October 2000 Koc University moved to its permanent campus at Rumeli Feneri, located on a hill close to the city but far removed from the distractions of city life. It sprawls over a sixty-two acre site. The sixty buildings, academic and administrative - laboratories, library, dormitories, faculty residences, social and sports facilities are the product of a meticulous, integrated design. Drawing upon warm and natural materials, including stone, plaster, wood and clay roof tiles, the architecture is a blend of the historical style of Istanbul and the timeless characteristics of well-established academic institutions."
    },
    {
        "Continent": "MiddleEast",
        "Country": "Turkey",
        "University": "Sabanci University",
        "Description": "Under the direction of one of Turkey's leading family-run foundations, the Sabancı Foundation, the Sabancı Group established Sabancı University in July 1994. More than fifty academicians from 22 different countries, students, and individuals from the private sector participated in the conference in August 1995. At the end of the conference, based on the knowledge and experience of the participants, the key philosophy of a 'world university' emerged: 'creating and developing together.' This conference was followed by design committees which worked under the guidance of a 'Student Tendency Survey' and other academic program design activities. The groundbreaking ceremony for the Sabancı University campus took place on July 31, 1997. The University began its first academic year on October 20, 1999. Today, Sabancı University has over 3,530 students; 3 faculties; 11 undergraduate programmes and 19 postgraduate programmes."
    },
    {
        "Continent": "CentralAsia",
        "Country": "Kazakhstan",
        "University": "KIMEP University",
        "Description": "KIMEP University has a license to offer academic programs from the Ministry of Education and Science of the Republic of Kazakhstan. The last visit of an attestation commission from the Ministry, on April 14-16 2008, resulted in KIMEP University being awarded five-year attestation for all its degree programs. KIMEP University currently offers fifteen degree programs, including undergraduate programs in Business Administration, Economics, Political Science and International Relations, Public Administration and Journalism, and masters programs in Business Administration, Economics, Law, and Teaching English as a Foreign Language. KIMEP University also offers a doctoral program in Business Administration. An Executive MBA program and a wide range of certificate programs and short courses are also offered. All KIMEP University degree programs are taught in English. KIMEP University faculty is made up of both Kazakhstani and expatriate scholars, the vast majority of whom earned their Masters and Doctoral Degrees from European and North American Universities. KIMEP is home to the largest concentration of Western Ph.D. holders of any institution of higher education in the CIS"
    },
    {
        "Continent": "Africa",
        "Country": "South Africa",
        "University": "University of Pretoria, Law",
        "Description": "UP is the leading research university in South Africa and one of the largest in the country. The University has six campuses as well as a number of other sites of operation, such as the Pretoria Academic Hospital. Central administration is located at the Hatfield campus. The University of Pretoria offers more than 1800 academic programmes in two of the official languages, namely Afrikaans and English. Some programmes and modules are offered only in English. In 1996, the University of Pretoria became the university with the highest research output in South Africa and have maintained this status. The academic programmes of the University are offered in the nine faculties stated below,as well as a business school. The faculties comprise a total of 140 departments and 85 centres, institutes and bureaus. UP is at the forefront of tertiary education in the country and collaborate with world-class partners to ensure continued excellence in learning and teaching."
    },
    {
        "Continent": "Africa",
        "Country": "South Africa",
        "University": "University of Pretoria, South Africa",
        "Description": "UP is the leading research university in South Africa and one of the largest in the country. The University has six campuses as well as a number of other sites of operation, such as the Pretoria Academic Hospital. Central administration is located at the Hatfield campus. The University of Pretoria offers more than 1800 academic programmes in two of the official languages, namely Afrikaans and English. (Some programmes and modules are offered only in English.) In 1996, the University of Pretoria became the university with the highest research output in South Africa and have maintained this status. The academic programmes of the University are offered in the nine faculties stated below, as well as a business school. The faculties comprise a total of 140 departments and 85 centres, institutes and bureaus. UP is at the forefront of tertiary education in the country and collaborate with world-class partners to ensure continued excellence in learning and teaching. "
    }
]